{"url": "https://www.axisbank.lk/personal-banking/foreign-currency-deposits.aspx", "bank": "axis", "name": "Foreign Currency Deposits", "details": " Foreign Currency Deposits The Foreign Currency Deposits allows you to save and get a lump sum after a few years, and at the same time ensure that your hard-earned savings are safe. Another major benefit of the Foreign Currency Deposits is available in two variants - Short Term Deposits and Re-Investment Certificate. Features of Axis Bank Foreign Currency Short Term Deposits Axis Bank Term Deposit Foreign Currency Accounts are meant for foreign exchange earning customers and foreign entities Minimum deposit amount in DBU: USD 100.00 and in multiples of USD 0.01. GBP 100.00 and in multiples of GBP 0.01. EUR 100.00 and in multiples of EUR 0.01. AUD 100.00 and in multiples of AUD 0.01. JPY 10000.00 and in multiples of JPY 1.00. --> Minimum deposit amount in FCBU: USD 10000.00 or equivalent and in multiples of 0.01 thereafter for all currencies. Minimum deposit period 30 days and in number of days thereafter. Maximum deposit period is 180 days. Interest payout on simple interest basis. There will be a single payout at maturity only. Premature closures are subject to the penal rates specified for each currency. This penal rate is to be decided by Head office, Treasury. No Part withdrawal of deposits. Nomination facility available. No Auto-renewal facility. Only Funds received from abroad, through banking channels approved by the Government of Sri Lanka will alone be accepted for deposit in Foreign currency and in Non-resident accounts. Features of Axis Bank Foreign Currency Re-Investment Certificate Minimum deposit amount in DBU USD 100.00 and in multiples of USD 0.01. GBP 100.00 and in multiples of GBP 0.01. EUR 100.00 and in multiples of EUR 0.01. AUD 100.00 and in multiples of AUD 0.01. JPY 10000.00 and in multiples of JPY 1.00. ---> Minimum deposit amount in FCBU: USD 10000.00 or equivalent and in multiples of 0.01 thereafter for all currencies. Minimum deposit period 6 months and in multiples of days thereafter. Maximum deposit period 60 months. Interest payout on maturity at Half-yearly compounding basis. Premature closures are subject to the penal rates specified for each currency. This penal rate is to be decided by Head office, Treasury. No Part withdrawal of deposits. Nomination facility. No Auto-renewal facility. Funds received from abroad, through banking channels approved by the Government of Sri Lanka will alone be accepted for deposit in Foreign currency and in Non-resident accounts. Who can open the Foreign Currency Depoit For DBU Individuals (Single or Joint), including non-residents Proprietorship Concerns Partnership Firms Limited Companies Association, Clubs, Societies, Trusts etc. Executors and Administrators and Liquidators Banks Government Departments For FCBU Non-resident Sri Lankans Non Nationals Companies registered outside Sri Lanka Companies registered with the board of Investment (BOI) in Sri Lanka Eligibility Criteria: You should meet all KYC requirements according to the prevailing regulations in Sri Lanka and Axis Bank policies to open this account with us. For more details contact us 0112577720 Annexure II - Documents Required "}