{"url": "https://www.axisbank.lk/personal-banking/reinvestment-certificate.aspx", "bank": "axis", "name": "Re-Investment Certificate", "details": " Re-Investment Certificate When it comes to investment, there are a lot of choices available for you. You can invest in stocks, government bonds, real estate, gold etc. But you should always remember that there's a tradeoff between risk and returns. With Axis Bank fixed deposits, you don't have to bother about reinvestments. We'll do that for you. One option is principal rollover, where only the principal is reinvested automatically. Another alternative is principal plus interest rollover, where the entire sum is reinvested automatically at maturity in your designated account. What's more, you can make changes in tenure, maturity, payment instructions etc. Axis Bank fixed deposits also offer a high level convenience that makes it an attractive instrument for those who don't want too many hassles with investment. Features of Axis Bank Re-Investment Certificate Available in LKR currency. Minimum deposit amount Rs. 5000.00 and in multiples of Rs 1.00 thereafter. Minimum deposit period 6 months and in multiples of 1 days thereafter. Maximum deposit period 60 months. Interest payout at Quarterly compounding basis. Premature closure of deposit allowed without penalty. Interest will be paid only for the period the deposit has actually remained with the Bank, at the rate applicable for the said period as prevailing on the date of making the deposit. Interest for any fraction period of less than a quarter would be calculated as per STD method. Part withdrawal of deposit in multiples of Rs. 1000.00 allowed without penalty. Nomination facility available. Auto-renewal facility available. Different rate of interest will be set for Senior Citizens with separate rate code for the same product. Who can avail the Re-Investment Certificate? Individuals (Single or Joint) including non-residents Proprietorship Concerns Partnership Firms Limited Companies Association, Clubs, Societies, Trusts etc. Executors and Administrators and Liquidators Banks Government Departments Senior Citizens Eligibility Criteria: You should meet all KYC requirements according to the prevailing regulations in Sri Lanka and Axis Bank policies to open this account with us. For more details contact us 0112577720 Annexure II - Documents Required "}