{"url": "https://www.axisbank.lk/personal-banking/facilities-senior-citizens.aspx", "bank": "axis", "name": "Facilities for Senior Citizens", "details": " Facilities for Senior Citizens Senior Citizen Saving Bank a/c Any person aged 55 years or above who is permitted to open a Savings account in LKR in Sri Lanka, as per CBSL guidelines and as described in Axis Bank's document titled \"General Terms and Conditions for Savings Deposits \" can open a Senior Citizen Saving Bank a/c Passbook facility Higher rate of interest than that paid to Regular Savings Accounts. ( Please see our Schedule of Interest Rates) No Minimum Balance requirement Online Banking / Internet banking facility as and when enabled Free Debit Card facility ( Please see our Schedule of Charges for issuance of duplicate cards and duplicate PIN mailers) Free Quarterly printed statements ( Please see our Schedule of Charges for additional statements) Facility for funds transfer through RTGS /Net Banking /SLIPS ( Please see our Schedule of Charges) Nomination Facility available Locker Facility G( Please see our Schedule of Charges) Free Pay Orders ( Please see our Schedule of Charges for Duplicate Pay Orders, Revalidation of Pay Orders and cancellation of Pay Orders) Free Standing Instruction set up for monthly transfer to Recurring Deposit Accounts Remit to India Schemes ( Please see our Schedule of Charges) International Funds Transfers / International Demand Drafts ( Please see our Schedule of Charges) Collection of Bills and Cheques ( Please see our Schedule of Charges) Request for change from one savings scheme to another is accepted once per calendar quarter and is effected from the beginning of the next calendar quarter. Senior Citizen Term Deposit a/cs with Monthly Interest Payout Higher rate of interest than that paid to regular Term Deposit a/cs with Monthly Interest Payout. ( Please see our Schedule of Interest Rates). Senior Citizen Term Deposit a/cs with Quarterly Interest Payout Higher rate of interest than that paid to regular Term Deposit a/cs with Quarterly Interest Payout. ( Please see our Schedule of Interest Rates). Senior Citizen Re-Investment Term Deposit a/cs Higher rate of interest than that paid to regular Re-Investment Term Deposit a/cs. ( Please see our Schedule of Interest Rates). Senior Citizen Recurring Deposit a/cs Higher rate of interest than that paid to regular Recurring Deposit a/cs. ( Please see our Schedule of Interest Rates). "}