{"url": "https://www.axisbank.lk/personal-banking/senior-citizens-savings-account.aspx", "bank": "axis", "name": "Senior Citizens' Savings Account", "details": " Senior Citizens' Savings Account If there's a time when you truly need quick and easy access to money, it's when you grow older. Axis Bank's tailor-made savings account for senior citizens takes care of their complex financial needs. Managing the senior citizens account is as simple and convenient as making a phone call or clicking on a link. What's more, as a senior citizens bank account holder, you get a higher rate of interest than that of a regular savings account. The senior citizens savings account is packed with features and facilities. For example, you don't have to worry about maintaining minimum balance in your senior citizens account. Plus, access your account; pay utility bills and even make quick fund transfers from your free internet banking facility (as and when enabled). Features of our Senior Citizens' Savings Account Only the principal amount will be rolled over. The interest will be either credited to your designated account or paid out. --> No Minimum Average Balance requirement. Pass book facility. Attractive Interest Rate higher than Regular Savings Accounts. One free Foreign Inward Remittance per month. (Our Bank charges only waived). Preferential exchange rate on inward remittances. Debit Card facility on a chargeable basis. Free Quarterly printed statements. Free monthly e-statement facility (as and when enabled). No Penalty for non-maintenance of Minimum Balance. Nomination Facility. Online Banking / Internet banking facility (as and when enabled). Free Standing Instruction set up for monthly transfer to Recurring Deposit Accounts. Free \"LKR\" Pay Order. Option to move account from one scheme to another. Change of scheme will be implemented only from the start of the next calendar quarter following the receipt of the request from the account holder. Who can open a Senior Citizens' Savings Account You should meet all KYC requirements according to the prevailing regulations in Sri Lanka and Axis Bank policies to open this account with us. For more details contact us 0112577720 Annexure II - Documents Required "}