{"url": "https://www.axisbank.lk/personal-banking/foreign-currency-savings-account.aspx", "bank": "axis", "name": "Foreign Currency Savings Account", "details": " Foreign Currency Savings Account Savings Accounts in foreign currency are opened in the Domestic Banking Unit only. Features of our Foreign Currency Savings Account Only the principal amount will be rolled over. The interest will be either credited to your designated account or paid out. --> Monthly Average Balance USD 100.00 GBP 100.00 EUR 100.00 AUD 100.00 JPY 10000.00 Debits will be effected on the basis of written request from the customer. Dual Interest Rate system provides for higher interest rate for balances maintained over the agreed threshold limit. Free Quarterly printed statements. Free monthly e-statement facility (as and when enabled). No Penalty for non-maintenance of Minimum Balance. Nomination facility for individuals No Cheque book , Pass book or Debit Card facility. Funds received from abroad, through banking channels approved by the Government of Sri Lanka will alone be accepted for deposit in Foreign currency and in Non-resident accounts. Who can open a Foreign Currency Savings Account Any foreign exchange earner in Sri Lanka aged 18 years or above, eligible as per Sri Lankan laws to maintain foreign currency accounts can open these accounts Eligibility Criteria Only the principal amount will be rolled over. The interest will be either credited to your designated account or paid out. --> The primary customer must be aged 18 years or more The customer should be able to submit a valid proof of identity and a valid address and undergo successful checks as per Axis Bank's policies in this regard Firms and Companies should produce the prescribed documents establishing the identity and address of the firm / company along with KYC of Authorised signatories as per regulatory requirements of Sri Lanka and undergo successful checks as per Axis Banks policies in this regard. For details refer Annexure II Who can open the Foreign Currency Savings Account Individuals (Single or Joint), including non-residents Proprietorship Concerns Partnership Firms Limited Companies Association, Clubs, Societies, Trusts etc. Executors and Administrators and Liquidators Banks Government Departments Annexure II - Documents Required "}