{"url": "https://www.axisbank.lk/personal-banking/priority-debit-card.aspx", "bank": "axis", "name": "Priority Debit Card", "details": " Priority Debit Card Features and Benefits Axis Bank's Priority Debit Card is more than just a debit card. It comes with a host of enhanced benefits and features. It is exclusively issued to Senior Citizens and our Priority segment customers. It is a result of our constant endeavor to understand your requirements and design products and services keeping you in mind. The benefits of Axis Bank Priority Debit Card include: Flexibility of usage This debit card gives you instant access to your account, whenever you wish to make a purchase, or transact at any Visa ATM in Sri Lanka or abroad. With your Priority Debit Card, you get unlimited free transactions at other Bank's ATMs in Sri Lanka. Your card will be activated for payment transactions at merchant outlets, within 24 hours of your first cash withdrawal transaction at any Visa ATM including Axis Bank ATM. Please note that while using your debit card at merchant establishments and also at any non-Axis Bank ATM (especially in other countries) you can access only your primary accounts linked to the card. Worldwide reach This International Visa Card is accepted at over 1,800 Visa ATMs and more than 20,000 Point of Sale terminals in Sri Lanka. It is accepted at more than 1.96 million Visa enabled ATMs and more than 29 million Visa enabled POS (Point of Sale) terminals worldwide. Zero Fuel Surcharge On using your Priority Debit Card for fuel purchases, you get a full waiver of fuel surcharge that would be normally applicable otherwise. Enhanced limits for cash withdrawal Especially for Priority Debit Card customers, the daily ATM Cash Withdrawal Limit has been enhanced to LKR 100,000 per day at all Axis Bank ATMs and the daily POS limit is Rs LKR 400,000 at Merchant Establishments; subject to the balances held/ available in the account. 24-Hour Emergency Helpline You can call our Emergency Helpline 94 11 2577720 for blocking your Card. Our Customer Service Executives will assist you. FAQs What is the Axis Bank Debit Card all about? Think about it as a much powerful version of the Debit Card. Your Axis Bank Debit Card brings just about everything within your reach, be it that exquisite gift for a dear one or that irresistible outfit for yourself. Your Axis Bank debit card gives you unmatched POS and ATM withdrawal limits. What's more, your Axis Bank Gold Debit Card is a Visa Card, giving you the flexibility of usage in Sri Lanka as well as abroad. You can use it across 1,800 Visa ATMs and more than 20,000 Point of Sale terminals in Sri Lanka. It is accepted at more than 1.96 million Visa enabled ATMs and more than 29 million Visa enabled POS (Point of Sale) terminals worldwide. That translates into an almost unlimited access to your account, no matter where you are. How do I get my Debit Card Activated? A Personal Identification Number (PIN) will be issued to you separately for using your Debit Card at ATMs. For your safety, your Debit Card is sent to you inactive for use at merchant locations. Please ensure that you have received your PIN before trying to activate your Card. To activate your Card, you will need to use the Card by entering the PIN for a cash withdrawal transaction at any Visa ATM or Axis Bank ATM. In case you apply for a duplicate/ replacement card, any card issued before which is active will be deactivated before issuing duplicate card. In case of any difficulty please call the Axis Bank Customer Service Number at 94 11 2577720. We will be glad to assist you. Debit Card ATM Usage You can use your Debit Card at any Axis Bank or Visa ATM, in Sri Lanka or overseas. Apart from Axis Bank ATMs in Sri Lanka, you can use your Debit Card at over 1,800 Visa ATMs in Sri Lanka and 1.96 million worldwide. This allows you 24-hour access to any of the accounts linked to your Debit Card. Can I use my Debit Card Internationally? Your Debit Card is valid both in Sri Lanka and overseas. However, issue and use of the Card shall be subject to the Exchange Control Regulations issued by the Central Bank of Sri Lanka and other applicable laws in force from time to time in Sri Lanka and as well as Axis Bank Terms and Conditions in force from time to time. Please refer the Most Important Terms and Conditions (MITC) and Debit Card Usage that will be provided to you along with your Debit Card. All of your Debit Card transactions (purchases as well as cash withdrawals) overseas must be made in strict accordance with the Exchange Control Act of the Central Bank of Sri Lanka prevailing from time to time. In the event of your failure to do so, you will be liable for action under the exchange control regulations of the Central Bank of Sri Lanka. How do I do Merchant Outlet Transactions? Using your Debit Card for shopping at any of the 20,000 Visa merchant outlets in Sri Lanka and more than 29 million worldwide couldn't be easier. Follow these simple steps to ensure total shopping satisfaction. Please note that since signature verification is essential for Debit Card transactions, you need to be physically present along with your Card at the time of purchase i.e. the Debit Card cannot be used for Mail Order and Telephone Order Transactions. Look for a Visa sign at the Point-of-Sale merchant establishment. The merchant must have a Flag Point-of-Sale card-swiping terminal. Present your Debit Card after making your purchase. The Card will be swiped by the merchant on a Visa Data Capture Terminal for authorisation. After a successful authorisation, a hold for the transacted amount will first be placed on your account. Your account will subsequently be debited for the transacted amount. Your limit applicable, as defined below, is subject to balance in your account. A sales slip will be generated. Check and sign the sales slip. Your signature must match that, on the Card. Ensure your Card is returned to you. Preserve your copy of the sales slip for future reference. The per day limit for usage of Debit card at Merchant outlet is LKR 400,000 subject to availability of balance in your account. What do I get with Debit Card? Additional Cards Additional Cards will be issued to joint account holders of the account, provided the operating instructions for the account are \"self\", \"either or\", \"any one or survivor\". Charges will be applicable for the additional Card as per the Issuance Charge applicable from time to time. Global Customer Assistance Service (GCAS) This is a priced service provided by Visa. Axis Bank Debit Cardholders can receive assistance from Visa Global Customer Assistance Service, 24 hours a day, 7 days a week. GCAS can be used for lost/stolen card reporting, emergency cash assistance or miscellaneous information that you may require overseas. The Visa Global Center Service numbers in select countries are as following: Australia: 1800 450346, Hong Kong: 800 900 782, Canada: 1866 639 1911, Germany: 0800 1822891, France: 0800 9404349, Japan: 00531 44 0022, Singapore 800 4481 250, United Kingdom: 0800 1695189, United States: 1 866 765 9644. For full listing of Visa Global Customer Assistance Services toll-free numbers, please visit VISA website. If the country you are in is not listed, or if you experience difficulties using any of the toll-free numbers, call on 1-303-967-1090. Please note that the service charges per transaction are as follows: Service Priority Classic Lost / Stolen Report Nil US$ 35.00 Cash / Card Replacement Nil US$ 175.00 Miscellaneous Inquiries US$ 5.00 US$ 5.00 Who should I contact if my card is lost or stolen? You should call Axis Bank Customer Service number immediately at 94 112577720 / 21 / 22 to report the loss of your Axis Bank Debit Card. Who should I contact if my ATM PIN is lost? You may contact the branch at 94 11 2577720 or write to the branch at axislk@axisbank.com What are the privileges on Axis Bank Priority Debit Card? Your Axis Bank Priority Debit Card provides you an enhanced daily ATM cash withdrawal limit of LKR 100,000 from any Axis Bank ATM plus the added advantage of unlimited free domestic Cash Withdrawal and balance inquiry transactions at all Visa/Plus ATMs in Sri Lanka (Axis as well as non-Axis Bank ATMs). All this comes at a very competitive price. However, on non-Axis Bank ATMs, there might be different cash withdrawal limits fixed by respective banks. How much will it cost me to have Axis Bank Priority Debit Card? Tariff Sheet Issuance Charge LKR 200 Annual Fee Nil Card Replacement Charges LKR 200 Duplicate Pin LKR 100 Transactional Charges at Visa ATMs (Axis Bank as well as non-Axis Bank) Abroad Cash Withdrawal LKR 150 Balance Inquiry LKR 50 The Bank charges 3% markup for International Transactions. Please note that Axis Bank does not charge the customer any transaction fee at merchant establishments. There are certain merchant categories like petrol pumps where there is a surcharge for using a card that are separately debited to your account and will appear as separate entries. The surcharge at petrol pumps of 2.5% of the purchase bill is waived off for Priority Debit Cardholder. Eligibility Criteria The customer should have one of the following accounts with Axis Bank to be eligible for the Axis Bank Debit Card: Savings Bank Account Self Either or Survivor Anyone or Survivor Current Account Individual Account Note - Minors are not eligible for the card. How to Apply Visit Us at Axis Bank Colombo, 356, Galle Road, Kollupitiya, Colombo 03 Write to us at- axislk@axisbank.com Call us at - 011-2577720 / 21 / 22 Downloads Debit Card Application Form Have an Axis Bank Debit Card? How to use your Card The Axis Bank Debit Card is a multifunctional card. It can be used at: Axis Bank ATMs For transactions such as cash withdrawals, balance inquiry, cheque or cash deposit, PIN change, mini statement etc. Visa or Visa Plus ATMs For cash withdrawals and balance inquiry transactions. Merchant establishments (displaying the VISA Electron sign and having Electronic Swipe Terminals): To make payments for purchases at shops, department stores or payments at restaurants, petrol pumps etc. Some Important Points ATMs Your Axis Bank Debit Card and Personal PIN are required for ATM Usage. Please memorise this PIN. It is recommended that you do not write your PIN on the Debit Card or anywhere in proximity to the card. Refrain from giving your PIN to any other person or merchant establishment or bank employee. Merchant establishments You can follow these simple steps to make payments at Merchant establishments with your Axis Bank Debit Card Please make sure you have sufficient balance in your primary account. Look for a VISA or VISA Electron sign at the point-of-sale merchant establishment. The merchant will have an electronic POS (Point Of Sale) swipe terminal. Present the debit card to the merchant at the time of making payment The merchant will swipe the card on the electronic POS terminal. After a successful authorisation, a hold is placed on your primary account (designated by you at the time of application) for the transaction amount. A sales slip is generated from the electronic swipe terminal. Check the amount on the sales slip and sign it. Your signature must match that on the debit card. The merchant verifies the signature and returns the card. Caution : You do not require your personal PIN for merchant establishments. For blocking of lost Debit Card, call 94 11 2577720 immediately. Do's and Don'ts Sign your card the moment you receive it. Always sign the card with a ballpoint pen. The moment you get your debit card, note down the card number and the emergency number. Should you ever misplace your card or if it gets stolen, you will be able to report a loss immediately. For security reasons, we advise you to keep a photocopy of the front and back side of the debit card with you. Keep the above two numbers in a place other than the wallet in which your card is kept. If your wallet gets stolen, you won't have to hunt for the emergency number. If going abroad, make note of the Visa emergency number abroad. Try and memorize the PIN instead of noting it down somewhere. Don't lend your card to anyone. Be well aware of who has access to your cards. If your debit card is borrowed by a family member (spouse, child, parent), with or without your knowledge, you are responsible for their purchase or cash withdrawal. Never disclose the card number unnecessarily. Do not give your debit card number over the phone or on the Internet. Never leave your card unattended at a shop or restaurant. Make sure the card returned to you at the merchant establishment is yours. When using your card in a merchant establishment, only your signature is needed. Never disclose any other personal details about yourself, be it your address or phone number. Never sign an incomplete sales slip. Make sure it is totaled. Always keep a copy of the bill and the payment slip and ATM receipts for cash withdrawals. Always check your billing statement. Check the purchases and compare it with the bills in your and receipts in your possession. If returning or handing over the card to the bank, make sure you give it to a bank official and cut it before doing so. This ensures that the card is never used again. The Debit card Features and Charges are summarized below for your reference: Features and Charges* Priority Classic Issuance charges 200 500 Annual Charges N/A N/A Replacement Charges 200 500 Duplicate PIN charges (over email as well as hard copy) 100 100 Daily POS limit (maximum) 400,000 400,000 Daily ATM limit (maximum) 100,000 80,000 Lost Card Insurance N/A N/A Personal Accident Insurance N/A N/A Transaction charges at AXIS Bank ATMs in Sri Lanka (Domestic Usage) Balance Inquiry, Withdrawal, Mini-statement, Deposit cash/cheque, Change PIN Nil Nil Transaction charges at non-AXIS Bank Visa ATMs in Sri Lanka (Domestic Usage) Balance Inquiry Cash Withdrawal Nil Nil 20 50 Transaction charges at AXIS Bank as well as non-AXIS Bank Visa ATMs outside Sri Lanka (International Usage) Balance Inquiry Cash Withdrawal 50 150 50 150 Fuel surcharge 0% 2.5% All charges in Sri Lanka Rupees (LKR) *The Bank charges 3% markup for International Transactions. "}