{"url": "https://www.axisbank.lk/corporate-banking/corporate-banking-wcp.aspx", "bank": "axis", "name": "Working Capital Finance", "details": " Working Capital Finance Letters of Credit (LC - Sight / Usance) Whether you are an exporter or an importer, Axis Bank Limited, Colombo offers a gamut of services to meet your entire Letter of Credit requirement including Opening, Advising and Confirming LCs. We structure Letters of Credit, Back to Back Letters of Credit to suit specific transaction requirements. Bill Collection Services Axis Bank Limited, Colombo offers flexible and efficient handling of commercial and financial documents for Imports and Exports. We have in place an extensive network and correspondent banking arrangements to facilitate the same. Purchase of Export Documents We can purchase / discount export documents in both kinds of export arrangements - Documents against Payment (D/P) and Documents against Acceptance (D/A). This facility allows our customers to receive a cash advance against an expected payment under Documentary Collections thus improving their cash flow. Receivables Discounting We can provide discounting for export bills with or without recourse basis, for sales to Buyers acceptable to us. Thus, customers may leverage Axis Bank Limited, Colombo's extensive understanding of Indian corporates for financing of their sales under Documentary Collection terms to Buyers in India. Through such a facility, the credit risk of the Buyer is covered by the Bank and the financing may be made with or without recourse to our customer. Short term loans/ Overdraft facility Axis Bank, Colombo offers working capital finance by way of overdraft or short term working capital loans, suitably structured to your needs and your risk profile. These products are designed to ease the liquidity position of the client. Buyers Credit Short Term Finance for payment of imports. Loans not exceeding 1 year for non Capital Goods and not exceeding 3 years for Capital Goods, can be extended against letter of undertaking from Banks. "}