{"url": "https://www.axisbank.lk/personal-banking/fund-transfer-through-axisremit.aspx", "bank": "axis", "name": "Fund Transfer through AxisRemit", "details": " Fund Transfer through AxisRemit We provide you a quick &amp; convenient remittance solution to transfer money to India to your loved ones. While providing you this remittance facility at a competitive exchange rate &amp; low price, our system ensures that your remittance is processed in a safe &amp; secure manner. Features &amp; Benefits \"Quick Money Transfers from Sri Lanka to India using AxisRemit\" Instant INR Credit to any Axis Bank Accounts across 1,947 branches in India INR Credit to Other Bank Accounts within 24 hours* Competitive &amp; Attractive Exchange Rates Convenient and Secure facility Zero charges for Axis Bank Colombo Account-holders *Subject to the receiving Bank's availability and hours of operation, and local regulations. Simple Steps to Send Money to India Step 1 Visit our Branch along with some personal identification with you. If you are not Axis Colombo Account-holder, you will be required to provide any one of the following documents to verify your Identity &amp; Address each: Identity proof National Identify Card (NIC) Passport Driving License Address proof Fixed Line Telephone bill/ Electricity bill/ Other Utility Bill (not being more than three months old) Bank Account Statement (not being more than three months old) Copy of latest tax assessment Letter from any recognized public authority verifying the identity, and address A certificate of a Grama Niladhari or Electoral register The customer will provide any other necessary document &amp; information as sought by the Bank and as applicable as per the local regulations. Step 2 Complete a simple ' Remittance Application ' form and hand this to the Branch official along with the above mentioned documents money you want to send and the transfer fee/commission. Mode of acceptance of funds would be: Cash Cheque Account Transfer (for Axis Bank Colombo Account-holders) Step 3 The Branch will process your transaction &amp; provide you a Remittance Reference Number. Step 4 The remitted amount will be credited to the beneficiary's account in India immediately if he/she is an Axis Bank Account holder. If the recipient's account is with other Bank in India, the same will be credited within 24 hours* *Subject to the receiving Bank's availability and hours of operation, and local regulations. Click here for Terms &amp; Conditions Service Charges The below charges will be applicable to a customer willing to remit funds to India through AxisRemit. Axis Bank Colombo Account holder- Zero charges Non-Axis Bank Colombo Account-holder- LKR 1,000 "}