{"url": "https://www.axisbank.lk/personal-banking/recurring-deposits.aspx", "bank": "axis", "name": "Recurring Deposits", "details": " Recurring Deposits Are you considering saving money a bit at a time? Axis Bank's recurring deposits offers you a chance to grow your net worth without taking any untoward risk. The recurring deposit allows you to save bit by bit and get a lump sum after a few years, and at the same time ensure that your hard-earned savings are safe. Another major benefit of the recurring deposit is that you don't have to worry about forgetting installments. Amounts are deducted automatically from your designated account so that you stay on the saving track. Features of Axis Bank Recurring Deposit Available only in LKR currency. Minimum deposit amount Rs. 1000.00 and in multiples of Rs 500.00 thereafter. Minimum deposit period 12 months and in completed quarters thereafter. Maximum deposit period 60 months. Interest payout on quarterly compounding basis on every quarter from the starting date of the deposit Pre-mature closure of deposit allowed without penalty. Interest will be paid only for the period the deposit has actually remained with the Bank, at the rate applicable for the said period as prevailing on the date of making the deposit. Interest for any fraction period of less than a quarter would be calculated as per STD method. Part withdrawal not allowed. Nomination facility available. Auto-renewal facility not applicable. Same rate of interest as RIC Fixed Deposits. Different rate of interest will be set for Senior Citizens with separate rate code for the same product. One installment to be credited to the account every month, between the 1st and last day of the month. Any delay in crediting the installment in the account will be treated as a late deposit of installment. This delay will be calculated in months and not in days, the same way as is done in India. For example, if a customer has to credit the installment on 31-03-2011 and he / she credits the amount on 02-04-2011 then the installment is considered as late by one month and not 2 days. At the same time, an installment due on 01-03-2011 will not be taken as late even if the credit comes in by 31-03-2011. Each delayed installment will attract a penalty at the same rate as currently applicable to inadvertent overdrafts. The formula for penalty calculation (per month) is (monthly installment * penalty rate) / 12 * (number of months delay). Unrecovered penalty would be set off against maturity proceeds. Date of maturity will be due date or one calendar month from the date of receipt of last installment, whichever is later. Who can open the Recurring Deposit? Individuals (Single or Joint) including non-residents Proprietorship Concerns Partnership Firms Limited Companies Association, Clubs, Societies, Trusts etc. Executors and Administrators and Liquidators Banks Government Departments Senior Citizens Eligibility Criteria: You should meet all KYC requirements according to the prevailing regulations in Sri Lanka and Axis Bank policies to open this account with us. For more details contact us 0112577720 Annexure II - Documents Required "}