{"url": "https://www.axisbank.lk/personal-banking/monthly-interest-certificate.aspx", "bank": "axis", "name": "Monthly Interest Certificate", "details": " Monthly Interest Certificate Axis Bank Monthly Interest Certificate offers guaranteed returns on a monthly basis that makes it an attractive instrument for those who don't want too many hassles with investment. Features of Monthly Interest Certificate Available only in LKR currency. Minimum deposit amount Rs. 5000.00 and in multiples of Rs 1.00 thereafter. Minimum deposit period 12 months and in completed months thereafter. Maximum deposit period 60 months. Interest payout on Monthly basis on every month from the starting date of the deposit. Only the option of interest payout as per calendar month is being offered at the moment. Premature closure of deposit allowed without penalty. Interest will be paid only for the period the deposit has actually remained with the Bank, at the rate applicable for the said period as prevailing on the date of making the deposit. Interest for any fraction period of less than a month would be calculated as per STD method. Part withdrawal not allowed. Nomination facility available. Auto-renewal facility available. Different rate of interest for FDs with monthly payout. There is no discounting of interest rate for MIC. Separate rate of interest, approved by Axis Bank Limited, HO Treasury will be applicable for this product. Different rate of interest will be set for Senior Citizens with separate rate code for the same product. Who can avail the Monthly Interest Certificate? Individuals (Single or Joint) including non-residents Proprietorship Concerns Partnership Firms Limited Companies Association, Clubs, Societies, Trusts etc. Executors and Administrators and Liquidators Banks Government Departments Senior Citizens Eligibility Criteria: You should meet all KYC requirements according to the prevailing regulations in Sri Lanka and Axis Bank policies to open this account with us. For more details contact us 0112577720 Annexure II - Documents Required "}