{"url": "https://www.nationstrust.com:443/personal/invest/investment-banking", "bank": "ntb", "name": "Investment Products", "details": " Government Securities (Treasury Bills/Treasury Bonds) Government Securities are safe and secure, backed by the full faith and credit of the Sri Lankan Government. Treasury Bills are with a maturity of less than one year while Treasury bonds are of longer term maturity. Features to note; Since it is issued by the sovereign Government, it is a risk free investment. Only a withholding tax of 10pct is charged at source. Since these are tradeable in the secondary market, provide instant liquidity. For Foreign Investors all maturity proceeds and capital gains can be repatriated <!-- About Us Page ==========================================--> Corporate Debt (Commercial Paper, Debentures, Trust Certificates) Commercial Papers, Debentures, Trust Certificates are notes issued by reputed blue chip companies to fulfill their short and long term borrowing requirements. Commercial Papers are short term investment opportunities while Debentures and Trust Certificates are for considerably longer tenors. Features to note; Considerably higher interest rates Investment opportunity with highly reputed blue chip companies Dependable Income Portfolio Diversity <!-- Portfolio Section ==========================================--> Repurchase Agreements (TB Repos, CP Repos) Repurchase Agreements (Repos) are transactions whereby funds are borrowed through the sale of securities on the condition that the instruments are repurchased at a given future date and generally done over a short tenor. TB Repo - Repurchase Agreements backed by Treasury Bills/Treasury Bonds CP Repo - Repurchase Agreements backed by Corporate Debt papers Features to note; The investment is secured by Treasury Bills/Bonds or Corporate Debt papers Higher Interest Rate No Withholding Tax (at present) Corporate Debt papers are further backed by the Bank Dual Currency Deposits (DCD) Dual Currency Deposits provides the opportunity to capitalize on the Foreign Exchange Market Volatility. Based on your risk preference and currency pair, you have the opportunity to earn a much higher interest rate on your foreign currency deposit than through conventional deposit schemes. "}