{"url": "https://www.nationstrust.com:443/personal/save/nations-max-bonus", "bank": "ntb", "name": "Nations Max Bonus", "details": " Enjoy an additional Bonus Interest up to 60% plus a free life insurance cover Nations Max Bonus Savings Account is an interest bearing account, that rewards customers with bonus interest on the balances maintained in the account. An account that gives you maximum benefits: A life cover of Rs. 100,000 and a critical illness cover of Rs. 25,000 Overdraft facility Free internet banking, and mobile banking facility Nations Shopping Debit Card <!-- About Us Page ==========================================--> Bonus Interest Rates Balance Slab (Rs.) Bonus Interest (%) Less than 10,000 0 10,000 - 49,999/99 30 50,000 - 99,999/99 40 100,000 - 249,999/99 50 250,000 and above 60 Base Interest rate 3.5% p.a. Bonus interest will be over and above this base rate. In order to be eligible for bonus interest customer should have only one withdrawal or no withdrawals from the account per month . Withdrawals include any Debit transaction such as ATM withdrawal, POS transactions, and fund transfer to another account in any payment mode (CEFT, SLIP, RTGS, Fund transfer, SI, Standing instruction etc. excluding any statutory deductions (WHT) and charges imposed by the bank (Minimum balance, transaction fees) Terms &amp; Conditions Key Facts Document <!-- Portfolio Section ==========================================--> Free Life Cover and Critical Illness Cover A lump sum amount up to Rs.100,000 will be paid in the unfortunate event of the death of the account holder due to any cause Rs.25,000 critical illness cover per calendar year Both covers will be active one month after opening the account To enjoy the insurance benefits, Rs.10,000 balance should be maintained in the account Life cover entitlement is up to the age of 70 years and critical illness cover up to the age of 60 years Max Bonus Critical Illness Cover What you need Be a resident Sri Lankan National over 18 years, in the possession of a valid National Identity Card A Non National holding a valid resident visa "}