{"url": "http://www.nsb.lk/product/iia-inward-investment-account/iia-inward-investment-account/", "bank": "nsb", "name": "IIA – Inward Investment Account", "details": " IIA – Inward Investment Account Who can open an account? Foreign nationals, institutions incorporated outside Sri Lanka, foreign institutional investors, foreign regional funds and our own Sri Lankans domiciled abroad. A non- national resident in or outside Sri Lanka. A non-national of Sri Lankan origin, who is a resident outside Sri Lanka A Sri Lankan citizen, resident outside Sri Lanka. A Company incorporated outside Sri Lanka. Country and Regional Funds, Mutual Funds, Unit Trusts and other Institutional investors who are established outside Sri Lanka. What are the ways that you can invest in? Shares (both listed and unlisted) Treasury Bonds Treasury Bills Units in Unit Trust Debentures Savings/Fixed Deposits in Foreign Currency or LKR Setting up of place of business under Overseas Company (OC ) Registered under the companies Act, No. 07 of 2007 Immovable Property Loans to residents extended under the special permission granted by Controller of Exchange to the borrower. Types of IIA Savings Account Fixed Deposit Account Minimum Balances of Savings Account IIA Currency USD/ EUR/ GBP/ AUD JPY LKR Minimum Balance 25/- 12,000/- 500/- Minimum Balances &amp; Types of Fixed Deposit Accounts. IIA Type of FD Minimum Balance Foreign Currency 1, 3, 6 &amp; 12 Months at Maturity USD/EURO/GBP/AUD 500/- &amp; JPY 60,000/- LKR 1 Month at Maturity 500,000/- 3,6, 12, 24, 36 &amp; 60 Months at Maturity 25,000/- 12 Months – Monthly 25,000/- What are the required documents to open a IIA account? Accounts could be maintained jointly amongst the eligible investors. Account Opening Form for Saving/Fixed Deposit. Mandatory declaration ( Annexure I. II, III ) For documents in respect of institutions, you may contact International Division. How the deposits can be made? Through NSB Representatives Overseas. Inward remittances received from abroad directly through international banking channels. Through NSB Channels of Correspondent banks / Exchange Houses / Worldwide Money Transfer Companies. Through Eurogiro Postal Network. Transfer of funds from Personal Foreign Currency Accounts (PFCA), Resident Non – National Foreign Currency Accounts (RNNFC), and Non –Resident Non – National Foreign Currency Accounts (NRNNFA) maintained with NSB or any Licensed Commercial Banks (LCBs) and accounts maintained at an Off-shore Banking Unit (OBU) in an LCB by the account holder. Foreign currency in the form of bank drafts or currency notes brought in to the country by the account holder on declaration to Sri Lanka Customs, as applicable, during visits to Sri Lanka of the account holder and tendered in person to NSB, provided that the drafts have been issued by a bank outside Sri Lanka. How to withdraw/Transfer money from the IIA Disbursements in Sri Lanka in Sri Lanka Rupees. Outward remittances in favor of the account holder. Transfers to or permitted investment options made in Sri Lanka including deposits held as savings/fixed with the bank. Repatriation of capital invested with associated earning. How you can check your Account: Through Internet Banking FOR FURTHER DETAILS PLEASE CONTACT National Savings Bank, International Division, No.70 1/1, Chatham Street, Colombo 01 Sri Lanka. Tel : + 94 11 2332043 + 94 11 2332292 + 94 11 2332018 + 94 11 2332142 Fax : +94112332136 E-mail : manager.ibu@nsb.lk OR NSB Call Centre: +94 11 2379379 (24 hours service) Our SWIFT Code is “NSBALKLX” "}