{"url": "http://www.nsb.lk/product/ranmasu/nsb-ranmasu/", "bank": "nsb", "name": "NSB Ranmasu", "details": " NSB Ranmasu PFCA – Personal Foreign Currency Account PFCA (NR) – For non residents in Sri Lanka (Previously known as NRFC, NRNNFA) PFCA (R) – For residents in Sri Lanka (Previously known as RFC, RNNFC) You can open Ranmasu PFCA (NR)/(R) accounts in USD (US Dollars), EURO, GBP (Grate Britain Pounds), AUD (Australian Dollars) and JPY (Japanese Yen). Who can open a PFCA (NR) account? An individual Sri Lankan national or Sri Lankan origin including minor. Non nationals visiting Sri Lanka. Sri Lankans employed abroad, while they are abroad or within 182 days of their return to Sri Lanka. Sri Lankans who are holding PFCA (NR) accounts with any other bank ( by transferring funds ) Who can open a PFCA (R) account? Nationals or non nationals resident in Sri Lanka What are the types of PFCA (NR)/(R) accounts that can be opened? Savings Accounts: This is an interest bearing account. Interest is computed on the minimum balance for the month and credited to the account at the end of the year. A statement of account is mailed at the end of June and December in lieu of the passbook. An advice will be mailed for all remittances, drafts and payment orders deposited and funds withdrawn from the account. Minimum Balance for PFCA (NR) – USD/EUR/GBP/AUD 25/- &amp; JPY 3,000/- Minimum Balance for PFCA (R) – USD/EUR/GBP 100/- , AUD 150/- &amp; JPY 12,000/- What are the required documents to open a PFCA (NR) savings account? Account Opening Form. Copy of passport pages containing personal/Visa details and/or with Citizenship or nature of Visa granted by Government for Sri Lankan origin individuals including minors Mandatory declaration ( Annexure I, II, III ) For Non Nationals – Passport &amp; Visa granted by Department of Immigration/Emigration with details of employment &amp; workplace in Sri Lanka What are the required documents to open a PFCA (R) savings account? Account Opening Form. Documentary proof of Identification ( Passport / NIC / Driving License ) Mandatory declaration ( Annexure I. II, III ) For Non Nationals – Passport &amp; Visa granted by Department of Immigration/Emigration with details of employment &amp; workplace in Sri Lanka. (Photocopy of the document should be produced with the original) Fixed Deposits: This is an Interest bearing account accepted for periods ; 1, 3, 6 and 12 months. Interest is calculated from the date opened or last renewed and paid at maturity. A fixed deposit receipt is issued for each deposit. Provision facility avialabel for automatic renewal of the deposit at maturity together with the interest earned or renewal of the principal amount after payment of interest. Minimum Balance for PFCA (NR)/(R) – USD/EUR/GBP/AUD 500/- &amp; JPY 60,000/-. Accounts can be opened as individual or joint, except that non nationals on temporary visit or intend to visit Sri Lanka are opened as individuals as per following Terms &amp; Conditions. ( 9-b, 9-C &amp; remark of Definition ) What are the required documents to open a PFCA (NR)/(R) Fixed Deposit account? Account Opening Form. Documentary proof of Identification. ( Passport / NIC / Driving License) Mandatory declaration ( Annexure I. II, III ) For documents in respect of institutions, you may contact International Division. * Kindly mention the Account name as “PFCA (NR)” or “PFCA (R)” on the account opening form and submit to one of our NSB Representatives abroad or locally. What are the currencies that can be deposited to a PFCA account? Although accounts are offered in the currencies in USD/EUR/GBP/AUD/JPY other designated foreign currencies are accepted as deposits to accounts. How does the interest rates affect to the earnings? Rates of interest on Ranmasu PFCA savings accounts will depend on market rates and are subject to change without notice. Interest on Ranmasu PFCA Fixed deposit accounts will be quoted on the date of deposit/renewal based on market rates. Interest is credited in the currency in which you maintain the account. How the deposits can be made? Through NSB Representatives Overseas. Inward remittances received from abroad directly through international banking channels. Through NSB channels of Bank’s Correspondent banks / Exchange Houses / Worldwide Money Transfer Companies. Through Eurogiro Postal Network. Transfer of funds from Personal Foreign Currency Accounts (PFCA), Resident Non – National Foreign Currency Accounts (RNNFC), and Non –Resident Non – National Foreign Currency Accounts (NRNNFA) maintained with NSB or any Licensed Commercial Banks (LCBs) and accounts maintained at an Off-shore Banking Unit (OBU) in an LCB by the account holder. Foreign currency in the form of bank drafts or currency notes brought in to the country by the account holder on declaration to Sri Lanka Customs, as applicable, during visits to Sri Lanka of the account holder and tendered in person to NSB, provided that the drafts have been issued by a bank outside Sri Lanka. Please make sure be accurate regarding Beneficiaries Account &amp; Bank details (Account Number, Name, &amp; Bank SWIFT Code – NSBALKLX) when Remitting funds. * The definition of the resident in terms of the determination published in the Gazette 2045/56 dated 20/11/2017. How to withdraw funds from the PFCA (NR) or (R) account ? By the in written request of the Account Holder, the withdrawal available in mode of Cash, Bank Drafts and Telegraphic Transfers (TT). What are the documents are required ? On personal application. (PFCA (NR)/ (R) withdrawal slip) Account transfers to third parties on written instructions from the Account Holder. What are the benefits offered by NSB ? Free of charge standing order facility for transfer of funds to the rupee accounts of NSB. Personal Loan facility up to 3 Million. Rupee loan up to 80% (fixed deposits) of the balance at an attractive interest rate. Issuance of bank draft and execution of telegraphic transfers. Provision for nomination. Savings account balances could be transferred to fixed deposits. Risk free – 100% Government Guaranteed Bank. Competitive interest rates. How you can check your Account: By the telephone call Over the counter Through Internet banking FOR FURTHER INFORMATION PLEASE CONTACT ; National Savings Bank International Division No.70 1/1, Chatham Street Colombo 01 Sri Lanka. Tel : + 94 11 2332043 + 94 11 2332292 + 94 11 2332018 + 94 11 2332142 Fax : +94112332136 E-mail : manager.ibu@nsb.lk OR NSB Call Centre: +94 11 2379379 (24 hours service) Our SWIFT Code is “NSBALKLX” The information provided hereon is based on current regulations and is subject to change without notice. "}