{"url": "http://www.nsb.lk/product/nsb-easy-card-2/nsb-easy-card/", "bank": "nsb", "name": "NSB EASY Card", "details": " NSB EASY Card This is a card that gives credit facilities exclusively to National Savings Bank Fixed Deposit Holders. This fulfils your needs today without affecting your fixed deposit or the growth of its interest with globally accepted NSB Easy. Don’t let your money be trapped in your Fixed Deposit. Make your dreams come true with NSB Easy. Make life brighter today as well as tomorrow. What is NSB EASY? NSB Easy is a Master Card Credit Facility which will be issued against your fixed deposit on a lower annual interest rate of 2.50 % above the FD rate. Why it is ‘NSB EASY”? No need to prove your income, just step in and apply for an EASY card against your deposit. Absolutely hassle free! Furthermore, you need not to bear the worry of carrying too many cards in your wallet. You can just get the NSB EASY facility linked to your existing NSB Master Card! How does it work and what it can be used for? The card will be issued with a credit limit up to a maximum 80% of the deposited amount. Maximum credit limit per card is Rs.1,000,000/= Can withdraw money from any ATM which has the Master Logo including NSB ATMS. The interest will be calculated for the amount withdrawn only from the date of withdrawal. Can be used to purchase goods / services from the Master Card accepted merchant locations, worldwide. Can be used during overseas tours Why your choice should be “NSB EASY”? No annual fee No charges for exceeding the credit limit No charge for late payments No stamp duty 10 NSB accounts could be linked to easy card without any additional fee or charge You can make the settlements the way you want Who can obtain the facility? The individuals or joint account holders of over 18 years, who maintain a fixed deposit for a period of 12 months or more (monthly or annual interest rates) under automatically renewed basis, shall be eligible to obtain such card *Conditions Apply For more details contact NSB Call Centre- (+94 11 2379379) 24 Hour Service Card Centre contact details Address : No. 100, Sir Chittampalam A. Gardiner Mawatha, Colombo 02. Contact number : 011 2 334 752 Fax : 011 2 334 758 Email : manager.cardcentre@nsb.lk "}