{"1": {"url": "http://www.nsb.lk/product/nsb-easy-card-2/nsb-easy-card/", "details": " NSB EASY Card This is a card that gives credit facilities exclusively to National Savings Bank Fixed Deposit Holders. This fulfils your needs today without affecting your fixed deposit or the growth of its interest with globally accepted NSB Easy. Don’t let your money be trapped in your Fixed Deposit. Make your dreams come true with NSB Easy. Make life brighter today as well as tomorrow. What is NSB EASY? NSB Easy is a Master Card Credit Facility which will be issued against your fixed deposit on a lower annual interest rate of 2.50 % above the FD rate. Why it is ‘NSB EASY”? No need to prove your income, just step in and apply for an EASY card against your deposit. Absolutely hassle free! Furthermore, you need not to bear the worry of carrying too many cards in your wallet. You can just get the NSB EASY facility linked to your existing NSB Master Card! How does it work and what it can be used for? The card will be issued with a credit limit up to a maximum 80% of the deposited amount. Maximum credit limit per card is Rs.1,000,000/= Can withdraw money from any ATM which has the Master Logo including NSB ATMS. The interest will be calculated for the amount withdrawn only from the date of withdrawal. Can be used to purchase goods / services from the Master Card accepted merchant locations, worldwide. Can be used during overseas tours Why your choice should be “NSB EASY”? No annual fee No charges for exceeding the credit limit No charge for late payments No stamp duty 10 NSB accounts could be linked to easy card without any additional fee or charge You can make the settlements the way you want Who can obtain the facility? The individuals or joint account holders of over 18 years, who maintain a fixed deposit for a period of 12 months or more (monthly or annual interest rates) under automatically renewed basis, shall be eligible to obtain such card *Conditions Apply For more details contact NSB Call Centre- (+94 11 2379379) 24 Hour Service Card Centre contact details Address : No. 100, Sir Chittampalam A. Gardiner Mawatha, Colombo 02. Contact number : 011 2 334 752 Fax : 011 2 334 758 Email : manager.cardcentre@nsb.lk "}, "2": {"url": "http://www.nsb.lk/product/iia-inward-investment-account/iia-inward-investment-account/", "details": " IIA – Inward Investment Account Who can open an account? Foreign nationals, institutions incorporated outside Sri Lanka, foreign institutional investors, foreign regional funds and our own Sri Lankans domiciled abroad. A non- national resident in or outside Sri Lanka. A non-national of Sri Lankan origin, who is a resident outside Sri Lanka A Sri Lankan citizen, resident outside Sri Lanka. A Company incorporated outside Sri Lanka. Country and Regional Funds, Mutual Funds, Unit Trusts and other Institutional investors who are established outside Sri Lanka. What are the ways that you can invest in? Shares (both listed and unlisted) Treasury Bonds Treasury Bills Units in Unit Trust Debentures Savings/Fixed Deposits in Foreign Currency or LKR Setting up of place of business under Overseas Company (OC ) Registered under the companies Act, No. 07 of 2007 Immovable Property Loans to residents extended under the special permission granted by Controller of Exchange to the borrower. Types of IIA Savings Account Fixed Deposit Account Minimum Balances of Savings Account IIA Currency USD/ EUR/ GBP/ AUD JPY LKR Minimum Balance 25/- 12,000/- 500/- Minimum Balances &amp; Types of Fixed Deposit Accounts. IIA Type of FD Minimum Balance Foreign Currency 1, 3, 6 &amp; 12 Months at Maturity USD/EURO/GBP/AUD 500/- &amp; JPY 60,000/- LKR 1 Month at Maturity 500,000/- 3,6, 12, 24, 36 &amp; 60 Months at Maturity 25,000/- 12 Months – Monthly 25,000/- What are the required documents to open a IIA account? Accounts could be maintained jointly amongst the eligible investors. Account Opening Form for Saving/Fixed Deposit. Mandatory declaration ( Annexure I. II, III ) For documents in respect of institutions, you may contact International Division. How the deposits can be made? Through NSB Representatives Overseas. Inward remittances received from abroad directly through international banking channels. Through NSB Channels of Correspondent banks / Exchange Houses / Worldwide Money Transfer Companies. Through Eurogiro Postal Network. Transfer of funds from Personal Foreign Currency Accounts (PFCA), Resident Non – National Foreign Currency Accounts (RNNFC), and Non –Resident Non – National Foreign Currency Accounts (NRNNFA) maintained with NSB or any Licensed Commercial Banks (LCBs) and accounts maintained at an Off-shore Banking Unit (OBU) in an LCB by the account holder. Foreign currency in the form of bank drafts or currency notes brought in to the country by the account holder on declaration to Sri Lanka Customs, as applicable, during visits to Sri Lanka of the account holder and tendered in person to NSB, provided that the drafts have been issued by a bank outside Sri Lanka. How to withdraw/Transfer money from the IIA Disbursements in Sri Lanka in Sri Lanka Rupees. Outward remittances in favor of the account holder. Transfers to or permitted investment options made in Sri Lanka including deposits held as savings/fixed with the bank. Repatriation of capital invested with associated earning. How you can check your Account: Through Internet Banking FOR FURTHER DETAILS PLEASE CONTACT National Savings Bank, International Division, No.70 1/1, Chatham Street, Colombo 01 Sri Lanka. Tel : + 94 11 2332043 + 94 11 2332292 + 94 11 2332018 + 94 11 2332142 Fax : +94112332136 E-mail : manager.ibu@nsb.lk OR NSB Call Centre: +94 11 2379379 (24 hours service) Our SWIFT Code is “NSBALKLX” "}, "3": {"url": "http://www.nsb.lk/product/ranmasu/nsb-ranmasu/", "details": " NSB Ranmasu PFCA – Personal Foreign Currency Account PFCA (NR) – For non residents in Sri Lanka (Previously known as NRFC, NRNNFA) PFCA (R) – For residents in Sri Lanka (Previously known as RFC, RNNFC) You can open Ranmasu PFCA (NR)/(R) accounts in USD (US Dollars), EURO, GBP (Grate Britain Pounds), AUD (Australian Dollars) and JPY (Japanese Yen). Who can open a PFCA (NR) account? An individual Sri Lankan national or Sri Lankan origin including minor. Non nationals visiting Sri Lanka. Sri Lankans employed abroad, while they are abroad or within 182 days of their return to Sri Lanka. Sri Lankans who are holding PFCA (NR) accounts with any other bank ( by transferring funds ) Who can open a PFCA (R) account? Nationals or non nationals resident in Sri Lanka What are the types of PFCA (NR)/(R) accounts that can be opened? Savings Accounts: This is an interest bearing account. Interest is computed on the minimum balance for the month and credited to the account at the end of the year. A statement of account is mailed at the end of June and December in lieu of the passbook. An advice will be mailed for all remittances, drafts and payment orders deposited and funds withdrawn from the account. Minimum Balance for PFCA (NR) – USD/EUR/GBP/AUD 25/- &amp; JPY 3,000/- Minimum Balance for PFCA (R) – USD/EUR/GBP 100/- , AUD 150/- &amp; JPY 12,000/- What are the required documents to open a PFCA (NR) savings account? Account Opening Form. Copy of passport pages containing personal/Visa details and/or with Citizenship or nature of Visa granted by Government for Sri Lankan origin individuals including minors Mandatory declaration ( Annexure I, II, III ) For Non Nationals – Passport &amp; Visa granted by Department of Immigration/Emigration with details of employment &amp; workplace in Sri Lanka What are the required documents to open a PFCA (R) savings account? Account Opening Form. Documentary proof of Identification ( Passport / NIC / Driving License ) Mandatory declaration ( Annexure I. II, III ) For Non Nationals – Passport &amp; Visa granted by Department of Immigration/Emigration with details of employment &amp; workplace in Sri Lanka. (Photocopy of the document should be produced with the original) Fixed Deposits: This is an Interest bearing account accepted for periods ; 1, 3, 6 and 12 months. Interest is calculated from the date opened or last renewed and paid at maturity. A fixed deposit receipt is issued for each deposit. Provision facility avialabel for automatic renewal of the deposit at maturity together with the interest earned or renewal of the principal amount after payment of interest. Minimum Balance for PFCA (NR)/(R) – USD/EUR/GBP/AUD 500/- &amp; JPY 60,000/-. Accounts can be opened as individual or joint, except that non nationals on temporary visit or intend to visit Sri Lanka are opened as individuals as per following Terms &amp; Conditions. ( 9-b, 9-C &amp; remark of Definition ) What are the required documents to open a PFCA (NR)/(R) Fixed Deposit account? Account Opening Form. Documentary proof of Identification. ( Passport / NIC / Driving License) Mandatory declaration ( Annexure I. II, III ) For documents in respect of institutions, you may contact International Division. * Kindly mention the Account name as “PFCA (NR)” or “PFCA (R)” on the account opening form and submit to one of our NSB Representatives abroad or locally. What are the currencies that can be deposited to a PFCA account? Although accounts are offered in the currencies in USD/EUR/GBP/AUD/JPY other designated foreign currencies are accepted as deposits to accounts. How does the interest rates affect to the earnings? Rates of interest on Ranmasu PFCA savings accounts will depend on market rates and are subject to change without notice. Interest on Ranmasu PFCA Fixed deposit accounts will be quoted on the date of deposit/renewal based on market rates. Interest is credited in the currency in which you maintain the account. How the deposits can be made? Through NSB Representatives Overseas. Inward remittances received from abroad directly through international banking channels. Through NSB channels of Bank’s Correspondent banks / Exchange Houses / Worldwide Money Transfer Companies. Through Eurogiro Postal Network. Transfer of funds from Personal Foreign Currency Accounts (PFCA), Resident Non – National Foreign Currency Accounts (RNNFC), and Non –Resident Non – National Foreign Currency Accounts (NRNNFA) maintained with NSB or any Licensed Commercial Banks (LCBs) and accounts maintained at an Off-shore Banking Unit (OBU) in an LCB by the account holder. Foreign currency in the form of bank drafts or currency notes brought in to the country by the account holder on declaration to Sri Lanka Customs, as applicable, during visits to Sri Lanka of the account holder and tendered in person to NSB, provided that the drafts have been issued by a bank outside Sri Lanka. Please make sure be accurate regarding Beneficiaries Account &amp; Bank details (Account Number, Name, &amp; Bank SWIFT Code – NSBALKLX) when Remitting funds. * The definition of the resident in terms of the determination published in the Gazette 2045/56 dated 20/11/2017. How to withdraw funds from the PFCA (NR) or (R) account ? By the in written request of the Account Holder, the withdrawal available in mode of Cash, Bank Drafts and Telegraphic Transfers (TT). What are the documents are required ? On personal application. (PFCA (NR)/ (R) withdrawal slip) Account transfers to third parties on written instructions from the Account Holder. What are the benefits offered by NSB ? Free of charge standing order facility for transfer of funds to the rupee accounts of NSB. Personal Loan facility up to 3 Million. Rupee loan up to 80% (fixed deposits) of the balance at an attractive interest rate. Issuance of bank draft and execution of telegraphic transfers. Provision for nomination. Savings account balances could be transferred to fixed deposits. Risk free – 100% Government Guaranteed Bank. Competitive interest rates. How you can check your Account: By the telephone call Over the counter Through Internet banking FOR FURTHER INFORMATION PLEASE CONTACT ; National Savings Bank International Division No.70 1/1, Chatham Street Colombo 01 Sri Lanka. Tel : + 94 11 2332043 + 94 11 2332292 + 94 11 2332018 + 94 11 2332142 Fax : +94112332136 E-mail : manager.ibu@nsb.lk OR NSB Call Centre: +94 11 2379379 (24 hours service) Our SWIFT Code is “NSBALKLX” The information provided hereon is based on current regulations and is subject to change without notice. "}, "4": {"url": "http://www.nsb.lk/product/atm-debit-cards/", "details": " ATM Debit Cards NSB introduces a range of Automated Teller Machine (ATM) Cards to grant you the convenience of not carrying cash everywhere you go. Backed by the world renowned VISA and Master Card Networks, NSB ATM Cards are an invaluable companion to you. With the convenience of a country wide NSB ATM network, you can withdraw cash from your NSB account at your convenience. I addition we have partnered with a host of other banks to enable you to withdraw cash from NSB accounts using other banks too! Whether Here or Abroad, keep a NSB ATM Card with you for all your financing needs. To obtain a NSB ATM card simply visit your nearest NSB Branch or for more information call us on our 24 hour hotline at +94 11 2 379 379. NSB ATM cards gives new meaning to cash. *Conditions Apply "}, "5": {"url": "http://www.nsb.lk/product/youth-savings/im/", "details": " NSB I’m IM caters exclusively to the aspirations of youth and is an excellent way of inculcating their savings habit and rewards them This awesome account has a host of benefits including: An attractive tiered interest rate. Up to 80% savings as a Loan. A special Interest rate for Buddhi Educational Loans. A special interest rate on loans to purchase Computers. A special interest rate on Diriya and Eco Loans. Master / Visa ATM Debit Card. Free Internet Banking Facility. Standing Order Facility. Special Gifts when the account holder reaches 21 years of age and on Childbirth* Career Guidance Programmes for A/L Students. Scholarships for University Students In addition, enjoy special offers from our partners including: Special Rates from Higher Educational Institutions. Insurance Covers. Data Packages. A range of attractive benefits with Ayubo.Life Health App. If you are between 20 &amp; 30 years of age, rush to your nearest NSB branch to open an IM account with only Rs. 1,000/= and begin your plan to achieve your dream. As a special treat to our youth, we offer attractive gifts for new IM customers. Hurry up and get your IM gifts while stocks last! NSB offers an unmatched security for the deposits of our customers, with the 100% guarantee by the Government of Sri Lanka. For further information on NSB IM simply visit your nearest NSB branch or call us on our 24 hour hotline at +94 11 2 379 379 Achieve your Dreams Current Offers Special offers on Education How to get connected with the health app community Step 1 Download the ayubo.life mobile app URL : apps.ayubo.life/download Step 2 Join the NSB i’m Community Enter the Promo code NSBIM during registration Click here for more details on ayubo.life Ayubo.life Hotline: 0720 111 222 *Conditions Apply "}, "6": {"url": "http://www.nsb.lk/product/national-savings-certificate-other/national-savings-certificate/", "details": " National Savings Certificate What is a National Savings Certificate? National Savings Certificate is a saving product which pays interest upfront without waiting for maturity. Anyone can afford a National Savings Certificate as they are available at different values of Rs. 500/-, Rs. 1,000/-, Rs. 5,000/-, Rs. 10,000/- and Rs, 25,000/-. for 3, 6, 12, 24, 36 and 48 months. Why should you buy a National Savings Certificate? If you surrender your certificate at the maturity, your interest is paid from the date of maturity. There is so much you can do with your Certificate… Those over the age of 7 years can purchase National Savings Certificates, a benefit no other Bank offers. Whenever the Certificates are surrendered before the date of maturity, reduced rate of interest will be paid for each completed month. This can also be given as a gift to your loved ones. National Savings Certificates are available at any NSB branch, Island wide. For more details call NSB Call Centre- (+94 – 11 2379379) 24 Hour Service "}, "7": {"url": "http://www.nsb.lk/product/other/gift-token/", "details": " Gift Token Often you may not be certain of the best gift you could give your beloved ones relatives or friends on their memorable days of life Why not “NSB Gift Tokens”? Unlike any other gift vouchers, these gift tokens can be either retained or deposited in your NSB savings account whenever you need. You can purchase NSB gift tokens from Rs100/- to Rs 5000/- in designated denominations. Gift tokens are available at any NSB outlet. For more details contact NSB Call Centre (+94 – 11 2379379) 24 hours Service. "}, "8": {"url": "http://www.nsb.lk/product/senior-citizens-term/nsb-gaurawa-term/", "details": " NSB Gaurawa Tired from a life of hard work? Thinking of relaxing in your retirement? NSB Gaurawa is the solution for you! With a Host of benefits including: Deposits between Rs.25,000/= and Rs. 20 million. A premium interest rate. Interest paid out monthly or on maturity. A variety of tenors. To invest in a NSB Gaurawa Deposit simply visit your nearest NSB Branch or for more information call us on our 24 hour hotline at +94 11 2 379 379. As always, NSB grants all its account holders the unmatched security of the deposits being 100% guaranteed by the Government of Sri Lanka. NSB Gaurawa – Our respect to you. *Conditions Apply "}, "9": {"url": "http://www.nsb.lk/product/minor-term/prarthana/", "details": " Prarthana NSB Prarthana Savings Certificates are for all those who wish their children to have a bright and secure future. Grant your children’s wishes be it higher education or even a travel abroad when they are older by investing in a Prarthana Savings Certificate today. What is a Prarthana Savings Certificate? NSB Prarthana comes in values of Rs.5,000/=, 10,000/=, 25,000/=, 50,000/= and 100,000/= payable when the child attains the age of 16. Simply pay only a fraction of the face value today but your child would stand to gain the entire face value at 16. Not affected by Interest fluctuations once the certificate is purchased. How Prarthana Works? Purchase price ( At Birth ) Value (At age of 16) Rs. 18,830.00 100,000.00 Rs. 9,415.00 50,000.00 Rs. 4,708.00 25,000.00 Rs. 1,883.00 10,000.00 Rs. 942.00 5,000.00 The purchase value has been computed on the basis of interest rates as at 01.09.2016 Purchase price of the certificate may vary according to the changes in the rate of interest and the age of the child but the face value will remain unchanged. To invest in a NSB Prarthana Savings Certificate, simply visit your nearest NSB Branch or for more information call us on our 24 hour hotline at +94 11 2 379 379. NSB offers an unmatched security for the deposits of our customers, being 100% guaranteed by the Government of Sri Lanka. "}, "10": {"url": "http://www.nsb.lk/product/ordinary-term/fixed-deposit/", "details": " Fixed Deposit Are you looking to invest your funds in a safe and lucrative instrument? Look no further, NSB Fixed Deposits Account is here! With a host of benefits including Attractive interest rates Interest paid out monthly or on maturity A variety of tenors Minimum as low as Rs. 1,000/= Individual or joint holding No age barrier to holding Automatic renewal To invest in a NSB Fixed Deposits Account, simply visit your nearest NSB Branch or for more information call us on our 24 hour hotline at +94 11 2 379 379. NSB offers an unmatched security for the deposits of our customers, being 100% guaranteed by the Government of Sri Lanka. NSB Fixed Deposits – The Safety Net for Investors. *Conditions Apply "}, "11": {"url": "http://www.nsb.lk/product/senior-citizens-savings/pensioners-account/", "details": " Pensioners Account Anticipating retirement benefits? Looking for an investment opportunity for your funds? Introducing NSB Pensioners’ Account designed exclusively for the retiree. NSB Pensioners’ Account is: A Fixed Deposit Account. A 12 month tenor with monthly interest payouts. A premium interest rate. Investment between Rs. 25,000/= and Rs. 2 million. To invest in a NSB Pensioners Account simply visit your nearest NSB Branch or for more information call us on our 24 hour hotline at +94 11 2 379 379. NSB offers an unmatched security for the deposits of our customers, being 100% guaranteed by the Government of Sri Lanka. NSB Pensioners Account – A reward for hard work. *Conditions Apply "}, "12": {"url": "http://www.nsb.lk/product/ladies-savings/sthree/", "details": " Sthree Every woman desires a comfortable life. National Savings Bank offers all women a chance to fulfill their dreams by offering “Sthree” – the savings plan designed exclusively for women. It is a savings scheme, which will lend you a hand to shoulder your responsibilities and to become the heiress to a better tomorrow. Savings starts from cents not from Rupees You being a cute sister, cared wife, loving mother, knowledgeable grandma, a respectable lady will play different roles in life as a teacher, as a nurse, as a doctor… your ideal dream to strengthen the economy of your family by saving “sathen sathe, rupiyalin rupiyala” and to build up a heavenly castle to your family, will be fruitful with “Sthree”. Making your dreams come true Being a woman, there are so many things that you would love to do. To dress up smartly – to adorn yourself with jewels – to maintain a beautiful home or to give your children the best possible education. Not only that, but also if you are a “Sthree” account holder, you can meet your urgent financial necessities by pawning your gold jewellery at 1% less than the normal rate of interest. New value additions A cash prize of Rs. 10,000/- as a wedding gift Free “prarthana” certificate with a face value of Rs. 50,000/- for a one baby. ATM / MasterCard or Visa Debit / Shopping Card facility. A cash prize of Rs. 1,500/- for the first graduation. A cash prize of Rs.10,000/- for 25th wedding anniversary A concessionary interest rate of 1% offered to Diriya , Buddhi, NSB eco loan schemes and for Pawning Advances under “Diriya Sthree” *Conditions apply For more details contact NSB Call Centre- (+94 – 11 2379379) 24 Hour Service "}, "13": {"url": "http://www.nsb.lk/product/investment-retirement-plans-savings/pas-avurudu-account/", "details": " Pas Avurudu Account It is a good habit to save a fraction of your hard earned money on monthly basis in our special long term “Pas Avurudu Ithurum Account” which offers attractive interest rates. Who can Open this Account? Any Sri Lankan over 16 years of age can open and operate. You can open this account as an individual, joint or a minor. However this account cannot be opened as Institutional, Courts, Security, and Trust Accounts. How to Open and maintained this Account? The account can be opened by a monthly deposit of Rs.100/-, Rs.200/-, Rs.300/-, Rs.400/-, Rs.500/- and Rs.1000/- or denominations of Rs.1000/- and the duration of the account will be 5 years (60 months). * The monthly deposit amount agreed upon, should be credited to the account on any day of each month without any failure. * The interest will be calculated daily and credited to the account on monthly basis. What are the Special Benefits Offered? Your interest rates will be determined based on the monthly deposit amount. Higher interest rate will be offered for higher deposit amounts. 100% government guarantee on all your savings and interest earned thereon. *Conditions Apply For more details contact NSB Call Centre- (+94 11 2379379) 24 Hour Service. "}, "14": {"url": "http://www.nsb.lk/product/investment-retirement-plans-savings/nsb-pension/", "details": " NSB Pension + NSB Pension + is a ground breaking solution for those who seek a tidy nest egg at retirement. With NSB Pension + you can now save for your retirement with a host of additional benefits including: An attractive return on investment. Eligibility to claim medical expenses up to a maximum of Rs one million on critical illnesses. Now NSB Pension + is even better with the option to maintain the account in foreign currencies including GBP, EUR and USD. If the deposit is in Sterling Pounds, US Dollars or Euros. The rates of interest payable are as follows: GBP 250 or multiples thereof 2.25% p.a Deposits less than GBP 250 1.25% p.a Euro 500 or multiples thereof 1.80% p.a Deposits less than Euro 500 1.00% p.a USD 500 or multiples thereof 3.00% p.a Deposits less than USD 500 2.00% p.a NSB Pension + has even garnered Global Recognition with the UK Government classifying this as a Qualified Overseas Pension Scheme (QROPS) To invest in a NSB Pension+ account simply visit your nearest NSB Branch or for more information call us on our 24 hour hotline at +94 11 2 379 379. NSB offers an unmatched security for the deposits of our customers, being 100% guaranteed by the Government of Sri Lanka. With NSB Pension+, get a global pension with a local flavour. Conditions Apply "}, "15": {"url": "http://www.nsb.lk/product/postal-savings/postal-savings/", "details": " Postal Savings The Ceylon Post of Savings Bank was the predecessor to the National Savings Bank and remembering its roots the NSB offers all its savings products through the nationwide Post Office Network to include the rural society. With the benefit of society in mind, NSB offers a 1% higher interest rate for all postal savings accounts above that offered at the NSB branches. Choose any of our savings instruments with a Postal Flavour and reap higher rewards. To invest in a NSB Postal Savings account simply visit your nearest Post Office or for more information call us on our 24 hour hotline at +94 11 2 379 379. As always, NSB grants all its account holders the unmatched security of the deposits being 100% guaranteed by the Government of Sri Lanka. NSB Postal Savings- Banking to the Masses *Conditions Apply "}, "16": {"url": "http://www.nsb.lk/product/minor-savings/hapan/", "details": " Hapan We at NSB understand that, saving for a child’s future is essential for a parent. NSB’s Hapan Children’s Account is the best solution for a concerned parent. NSB Hapan is a tailor made savings solution for a newborn or a preschooler and even a schooling child. Special benefits of Hapan includes: The lowest minimum deposit of Rs.5/=. A Premium Interest Rate. Attractive Gift Schemes Cash Prizes for a Island first, second, third ranks and the top 15 ranks in each District at the Grade 5 Scholarship Exams. Hurry up and invest in a NSB Hapan Account to ensure a better future for your precious children. To open a NSB Hapan Account visit your nearest NSB Branch or for more information call us on our 24 hour hotline +94 11 2 379 379. NSB offers an unmatched security for the deposits of our customers, being 100% guaranteed by the Government of Sri Lanka. NSB Hapan – For a brighter future for your child. *Conditions apply "}, "17": {"url": "http://www.nsb.lk/product/happy-savings/happy/", "details": " Happy Have you ever thought of receiving an attractive interest rate with the facility to withdraw your savings at your own pleasure at any time? We shall make you happy with a happy interest for savings up to 7.00% What is the Happiest Interest for Savings? Amount Rs : Interest Rate 1,000 – 40,000 4.25% 40,001 – 100,000 5.50% 100,001 – 250,000 6.00% 250,001 – 500,000 6.50% Above 500,001 7.00% Are there any restrictions for withdrawals? No, the happiest news is that there are no restrictions on withdrawals. What are the benefits? ATM / MasterCard or Visa Debit / Shopping Card facility. A statement for your account instead of a pass book. Loan against savings up to 60% of the deposit. Who can open a Happy Savings Account? Any Sri Lankan citizen over 16 years of age can open a Happy Savings account. Please visit your nearest NSB outlet. For more details contact: NSB Call Centre ( +94 11 2379379) 24 Hour Service *Conditions Apply "}, "18": {"url": "http://www.nsb.lk/product/ordinary-savings/ordinary/", "details": " Ordinary The popular savings account chosen by generations of families, NSB’s Ordinary Savings is the mainstay of the Nation’s Savings Culture and remains the “GO TO” Savings Product of Sri Lankans. NSB Ordinary Savings boasts an array of benefits including: Master/ Visa ATM Debit or Shopping Card Loans against savings of up to 80% of the account balance. Standing Order Facility Free Internet Banking Facility. Free SMS Alerts. Now NSB Savings Accounts is even better with the NSB Salary Earners Savings Account (SESA). The special benefits of SESA includes: Receiving salaries on the same day they are credited to their accounts by the employers. Competitive pawning advances. Payment of monthly bills Purchase of cheques. Concessions on loans offered by the Bank. Join the millions of account holders by visiting your nearest NSB Branch or for more information call us on our 24 hour hotline at +94 11 2 379 379. As always, NSB grants all its account holders the unmatched security of the deposits being 100% guaranteed by the Government of Sri Lanka. Save today for a better tomorrow. *Conditions Apply "}}