{"url": "https://www.peoplesbank.lk/bfca", "bank": "people", "name": "BFCA", "details": " Persons eligible to open Business Foreign Currency Accounts (BFCA) The following persons in, or resident in, Sri Lanka who earn foreign exchange: An individual resident in Sri Lanka. A sole proprietorship or partnership registered in Sri Lanka where the proprietor or a majority of partners are resident in Sri Lanka (in case of a partnership with two partners, at least one partner shall be a resident in Sri Lanka). A company incorporated in Sri Lanka. A company incorporated outside Sri Lanka which is registered as an overseas company under the Companies Act No 7 of 2007. An administrator or executor of the estates of a deceased person, who maintained A State Institution with the recommendation of the Secretary to the relevant line Ministry or appropriate Authority. A person authorized to carry on business as a shipping agent or a general sales agentin Sri Lanka on behalf of a foreign shipping line or airline (foreign principal) with a valid license or authorization letter issued by the Director General of Merchant Shipping and Director General of Civil Aviation Authority of Sri Lanka, respectively. An administrator or executor of the estate of a deceased person, who maintained a Business Foreign Currency Account (BFCA) with that authorized dealer or restricted dealer, until the completion of the administration of the deceased persons’ estate. A receiver or liquidator, in the name of a Company that maintained a Business Foreign Currency Account (BFCA) with that authorized dealer or restricted dealer, until proceedings are concluded. Non-Governmental Organization are not permitted to open and maintain a Business Foreign Currency Account (BFCA). Accounts may be opened in the form of a Savings Account , Fixed Deposit Account or current Accounts in any following Designated Foreign Currency. US Dollars Singapore Dollars Canadian Dollars Sterling Pounds Australian Dollars Euro Swiss Francs Hong Kong Dollars Japanese Yens New Zealand Dollars Swedish Kroners Danish Kroners Norwegian Kroners Chinese Yuan (Renminbi) Benefits Attractive Interest Rates 100 % protection on your investment Inward remittances credited to Accounts free of charge * Applicable according to the eligibility and the a/c holder and subject to other Terms and Conditions Permitted Credits Remittances received in foreign exchange from abroad through the banking system in respect of, export of goods and services, entrepot trade, overseas projects undertaken by the account holder, investments made outside Sri Lanka and goods supplied locally to a person resident outside Sri Lanka. Remittances received in foreign exchange through the banking system from the overseas employers with whom the account holder has an arrangement for the disbursement of wages and/or earnings of Sri Lankans who are rendering services to such overseas employer. Foreign currency in the form of travellers’ cheques, bank drafts or currency notes accepted by the account holder in Sri Lanka in respect of goods and services supplied by such person to a person resident outside Sri Lanka. Where the account holder is a shipping agent or a general sales agent in Sri Lanka, remittances received in foreign exchange through the banking system from the respective foreign principal or from a designated third party on behalf of the foreign principal for the purposes under the respective agency agreements. Freight collected in foreign exchange by the account holder who is a shipping agent or a general sales agent in Sri Lanka on behalf of the foreign principal, by way of a remittance against a Business Foreign Currency Account (BFCA) or an account maintained in the Offshore Banking Unit. Foreign currency brought into Sri Lanka by the account holder upon declaration [i.e., where such foreign currency notes exceeds or equals to USD 15,000 or its equivalent in other foreign currency on a declaration to Customs Department or where such foreign currency notes are less than USD 15,000 or its equivalent in other foreign currency on an appropriate declaration to the authorized dealer]. Transfers from Business Foreign Currency Accounts (BFCA) or accounts maintained in the Offshore Banking Unit, irrespective of the account holder. Payments received in foreign exchange in favor of the account holder being consideration for goods or services supplied to a resident, to the extent such payments and receipts or categories of transactions have been permitted by directions issued by the Central Bank. Proceeds of foreign currency loans and advances obtained by the account holder from the domestic banking unit or Offshore Banking Unit of an authorized dealer, with the prior approval of the Central Bank Proceeds or any part thereof from sale of any foreign asset of the account holder, where the asset had been acquired by debiting the Business Foreign Currency Account. Capital, capital gains and other receipts arising from investments made in Sri Lanka in foreign currency, if the original transfer had been made by debiting the Business Foreign Currency Account (or from the Foreign Exchange Earners’ Account (FEEA) of the account holder prior to this order come into effect). Capital and capital gains received from foreign investments into an Outward Investment Account (OIA), if the original investment had been made by debiting the Foreign Exchange Earners’ Account (FEEA) of the account holder prior to this order come into effect. Unutilized foreign currency obtained by the account holder debiting the Business Foreign Currency Account as per sub Paragraph 4 (c) and 4 (d) under “Permitted Debits” of this Circular. Unutilized balance remaining in the Foreign Travel Card of the same account holder, up to the amount such Foreign Travel Card had been loaded from the Business Foreign Currency Account. Insurance premier received by the account holder on foreign currency denominated policies issued to eligible customers and co-insurers and claims received from re-insurers and National Insurance Trust Fund by Insurance companies registered with the Insurance Board of Sri Lanka. Transfers from Personal Foreign Currency Accounts of the non-national employee resident in Sri Lanka, being over payments of salaries and any other benefits. Transaction or Transfers from any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by Directions issued by the Central Bank. Remittances originating outside Sri Lanka from the account holder in terms of Section 8 (3) of the Act. Interest earned in foreign currency on the funds held in the account. Foreign currency drafts issued by banks in Sri Lanka on behalf of the holders of Business Foreign Currency Accounts (BFCA) in respect of sale of goods and providing services by the account holder. Proceeds of foreign currency loans (including debt securities) transferred from IIA of the foreign lender, where such loans have been obtained in terms of an approval granted under the provisions of the Act (excluding loans obtained for the purposes of capital transactions outside Sri Lanka). Payments received in respect of goods sold and services rendered by the account holder to a person resident outside Sri Lanka where payments for such goods and services have been made through an Electronic Data Capture Terminal or Internet Payment Gateway (EDC/IPG), by using an Electronic Fund Transfer Card (EFTC) issued outside Sri Lanka, provided however that the Authorized Dealer shall credit such payment into a BFCA only upon written confirmation by the EDC/IPG provider stating that it contains payments made using an EFTC issued outside Sri Lanka. Remittances received in foreign exchange from abroad through the banking system in respect of lease or rent of immovable property in Sri Lanka to a person resident outside Sri Lanka by the account holder. Transfers from a Foreign Currency Loan Account (FCLA) for the purpose of acquisition / construction/development and renovation of a residential property in Sri Lanka of the account holder. Under no circumstances Sri Lanka Rupees shall be converted into foreign currency and be credited into a Business Foreign currency Account (BFCA). Permitted Debits Any outward remittances made outside Sri Lanka. Disbursements in Sri Lanka in Sri Lanka Rupees. Withdrawal in foreign currency notes up to USD 10,000 (or equivalent in any other foreign currency) for travel purpose as permitted by directions issued by the Central Bank. Withdrawal in foreign currency notes up to USD 50,000 (or equivalent in any other foreign currency) at a time by gem and jewellery dealers for the purpose of purchasing cut and polished or rough gem stones and other raw materials abroad upon submission of confirmation obtained from the National Gem and Jewellery Authority. Where the account holder is a shipping agent or a general sales agent in Sri Lanka, withdrawal in foreign currency notes up to USD 50,000 (or equivalent in any other foreign currency) per vessel per call as Cash-to-Masters, against inward remittance received from the foreign principal or from designated third parties on behalf of the foreign principal, on a request with the reasons acceptable to the authorized dealer. Where the account holder is a shipping agent or a general sales agent in Sri Lanka, repatriation of the surplus funds to the foreign principal, provided that a confirmation in writing is obtained from the account holder (i.e., Agent) to the effect that adequate funds have been retained in the account, to meet all local liabilities of the foreign principal in Sri Lanka including tax payable to the Government and the agency commission. Transfers to Business Foreign Currency Accounts, Personal Foreign Currency Accounts or accounts maintained in the Offshore Banking Unit, irrespective of the account holder. Transfers to an Outward Investment Account (OIA) of the same account holder. Transfers to an Inward Investment Account (IIA) of a resident outside Sri Lanka for the purpose of repayment of a foreign currency loan obtained from such foreign lender by the account holder. Transfer of funds for uploading a Foreign Travel Card. Debt servicing expenses and repayment of foreign currency loans obtained by the account holder from authorized dealers or restricted dealers. Transfers in respect of any investment permitted to be made in Sri Lanka in foreign currency utilizing funds in the Business Foreign Currency Account. Payments of claims to eligible customers and co-insurers in respect of foreign currency denominated policies, premier to local or overseas re-insurers and National Insurance Trust Fund and brokerage by insurance companies registered with the Insurance Board of Sri Lanka. Payments to residents in foreign exchange in respect of transactions or categories of transactions, to the extent such transactions have been permitted by directions issued by the Central Bank. Transactions or Transfers to any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by directions issued by the Central Bank. Documents and information required For individuals, account opening application and a photocopy of National Identity Card or valid Passport (Pages depicting details of the applicant and alterations). With respect to Sole Proprietorships, account opening application and for Partnerships With respect to Companies, A/C open Applications and other relevant documents stipulated in the application. For more information please visit the nearest branch of People's Bank or contact us Manager - Foreign Currency Department , People’s Bank, Overseas Customer Services Tel: +94 112332745 General Nos: 2332746 / 2334278 / 2437621 / 2446409 nrfc@peoplesbank.lk Special benefits Special benefits: Attractive Interest Rates 100 % protection on your investment Inward remittances credited to Accounts free of charge "}