{"url": "https://www.peoplesbank.lk/pfca", "bank": "people", "name": "Foreign Currency Deposit Accounts", "details": " Eligibility An individual including a minor who is a Sri Lankan national. An individual of Sri Lankan origin including a minor who is a resident outside Sri Lanka. A non-national resident in Sri Lanka. A non-national either on temporary visit to Sri Lanka or intending to visit Sri Lanka. An administrator or executor of the estates of a deceased person, who maintained A Personal Foreign Currency Account (PFCA) with that authorized dealer or restricted dealer until the completion of the administration of the deceased person's estate. Accounts may be opened in the form of a Savings Account , Fixed Deposit Account or current Accounts (Without cheque drawing facility) in any following Designated Foreign Currency. US Dollars Singapore Dollars Canadian Dollars Sterling Pounds Australian Dollars Euro Swiss Francs Hong Kong Dollars Japanese Yens New Zealand Dollars Swedish Kroners Danish Kroners Norwegian Kroners Chinese Yuan (Renminbi) Required documents and information The following information and documents are required to open a PFCA, as applicable; Eligible Persons Information / Documents i An individual of Sri Lankan origin including a minor who is a resident outside Sri Lanka. Full name, nationality and foreign address Passport number, date of issue and validity period Date of departure from Sri Lanka Citizenship or nature of visa granted by a foreign Government Account Opening Application FATCA Declaration ii A non-national resident in Sri Lanka Full name, nationality and foreign address Address of workplace in Sri Lanka and designation, if any Copy of the employment contract and salary particulars Copies of passport and visa granted by the Department of Immigration and Emigration Account Opening Application FATCA Declaration iii A non-national either on temporary visit to Sri Lanka or intending to visit Sri Lanka Full name, nationality and foreign address Copies of passport and visa pages Account Opening Application FATCA Declaration Benefits Debit Card issued free of charge Credit Card facilities are available against the funds in the Accounts. Monthly Interest. Inward Remittances credited to Accounts free of charge Outward Remittances Instant loans up to 90% of the FC A/C balances. Internet banking, Mobile banking and Voice banking facilities Ability to transfer funds within the Bank or different Banks. Free insurance cover * (Minimum balance of USD 250/- should be maintained for 6 months continuously prior to the incident ) Accident insurance cover up to Rs. 1,000,000/- for death /permanent disability Medical cover up to Rs.100,000/- Free baggage insurance cover up to Rs. 50,000/- * Applicable according to the eligibility and the a/c holder and and subject to other Terms and Conditions. * Terms and Conditions apply Permitted Credits Remittances in foreign exchange received from outside Sri Lanka in favor of the account holder through the banking system. Unutilized foreign currency obtained by the account holder by debiting the Personal Foreign Currency Account for travel purpose as permitted by directions issued by the Central Bank. Foreign currency brought into Sri Lanka by the account holder upon declaration [i.e., where such foreign currency notes exceeds or equals to USD 15,000 or its equivalent in other foreign currency on a declaration to Customs Department or where such foreign currency notes are less than USD 15,000 or its equivalent in other foreign currency, on an appropriate declaration to the authorized dealer or restricted dealer]. Transfers from Personal Foreign Currency Accounts (PFCAs), Business Foreign Currency Accounts (BFCAs) or accounts maintained in the Offshore Banking Unit, irrespective of the account holder. Where the account holder is a resident outside Sri Lanka or a non-national resident in Sri Lanka, transfers from an Inward Investment Account (IIA) of the same account holder. Transfers from Capital Transactions Rupee Account (CTRA) of the same account holder as permitted by directions issued by the Central Bank. Transfers from Diplomatic Foreign Currency Accounts (DFAs) of any other person. Capital, capital gains and other receipts arising from investments made in Sri Lanka in foreign currency, if the original transfer had been made by debiting the Personal Foreign Currency Account (PFCA) [or from the Non-Resident Foreign Currency Account (NRFC), Resident Foreign Currency Account (RFC) or Resident Non-National Foreign Currency Account (RNNFC) of the account holder, prior to this order come into effect]. Capital and capital gains received from foreign investments into an Outward Investment Account (OIA), if the original investment had been made by debiting the Non-Resident Foreign Currency Account (NRFC), Resident Foreign Currency Account (RFC) or Resident Non-National Foreign Currency Account (RNNFC) of the account holder, prior to this order come into effect. Unutilized balance remaining in the Foreign Travel Card of the same account holder, up to the amount the Foreign Travel Card had been loaded from the Personal Foreign Currency Account (PFCA). Where the account holder is a non-national employee resident in Sri Lanka, transfers from employers’ Sri Lanka Rupee account as monthly salary, employment benefits and other related benefits. Where the account holder is a non-national employee resident in Sri Lanka, amounts in Sri Lanka Rupees authorized by the Central Bank for remittance abroad, converted at the rate of exchange obtained on the day of credit. Transactions or Transfers from any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by directions issued by the Central Bank. Remittances originating outside Sri Lanka from the account holder in terms of section 8(3) of the Act Interest earned in foreign currency on the funds held in the account. Permitted Debits Any outward remittances made outside Sri Lanka. Disbursements in Sri Lanka in Sri Lanka Rupees. Transfers to Personal Foreign Currency Accounts or accounts maintained in the Offshore Banking Units, irrespective of the account holder. Where the account holder is a resident outside Sri Lanka or a non-national resident in Sri Lanka transfers to an Inward Investment Account (IIA) of the same account holder. Transfer of funds for uploading a Foreign Travel Card. Transfers in respect of any investment permitted to be made in Sri Lanka in foreign currency utilizing funds in the Personal Foreign Currency Account (PFCA). Withdrawal in foreign currency notes up to USD 10,000 (or equivalent in any other foreign currency) for travel purpose as permitted by directions issued by the Central Bank. Where the account holder is a non-national resident outside Sri Lanka who is on temporary visit to Sri Lanka, withdrawals in foreign currency. Where the account holder is a non-national employee resident in Sri Lanka, transfers to Business Foreign Currency Accounts (BFCAs) of the employer in respect of over payment of salaries and any other payment due to such employer. Transfers to employers’ Sri Lanka Rupee account in the event of an over payment to a non-national employee resident in Sri Lanka, as per the sub paragraph (k) under the \"Permitted Credits\". Payments to residents in foreign exchange in respect of transactions or categories of transactions, to the extent such transactions have been permitted by directions issued by the Central Bank. Transactions or Transfers to any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by directions issued by the Central Bank. Transfer of funds to a Foreign Currency Loan Account (FCLA) or an LKR Loan Account (LLA) of the account holder. For more information please visit the nearest branch of People's Bank or contact us Manager - Foreign Currency Department , People’s Bank, Overseas Customer Services +94 112332745 General Nos: 2332746 / 2334278 / 2437621 / 2446409 nrfc@peoplesbank.lk Special benefits Special benefits: Debit Card issued free of charge Credit Card facilities are available against the funds in the Accounts. Monthly Interest. "}