{"url": "https://www.peoplesbank.lk/oia", "bank": "people", "name": "OIA", "details": " OIA account may be opened in the form of a Savings Account in any designated Foreign Currency. Persons eligible to open an Outward Investment Account (OIA) Companies registered under the Companies Act, No. 07 of 2007 other than a Company limited by guarantee. A partnership registered in Sri Lanka. An individual resident in Sri Lanka. A Non- Governmental Organization shall not be permitted to open and maintain an Outward Investment account (OIA). Any person against whom or any company or partnership against which legal proceedings or investigations are pending in respect of a prosecution under the provisions of the repealed Exchange Control Act or Foreign Exchange Act, No.12 of 2017, shall not be permitted to make any outward remittance in respect of a permissible capital transaction without obtaining clearance for such remittance from the Central Bank. Permitted Credits Sri Lanka Rupee proceeds of the eligible resident investors converted into foreign currency, up to the investment requirement, to the extent such limits specified in terms of the regulations issued under the provisions of the Foreign Exchange Act, No.12 of 2017. Transfers from Business Foreign Currency Account of the account holder. Proceeds of a loan (including the issue of debt securities) obtained from a foreign source through an Inward Investment Account (IIA) of the lender, in order to finance an overseas capital transaction (i.e., an outward investment) permitted in terms of the provisions of the Foreign Exchange Act, No.12 of 2017. Remittances as dividends, proceeds on sale, maturity capital gains and liquidation proceeds, capital reductions receivable of shares, sovereign bonds, units, debt, securities, profits, margins and surplus funds, management fees, consultancy fees and commissions or any other related receipts etc. (including any subsequent shares devolving on the investor by virtue of a corporate action by the issuer, exercise of a right, entitlement or conversion), received in respect of capital transactions undertaken outside Sri Lanka by persons resident in Sri Lanka as permitted under the provisions of the Foreign Exchange Act, No.12 of 2017 or the repealed Exchange Control Act, where such capital transactions have been made through the same Outward Investment Account. Transactions or transfers from any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by directions issued by the Central Bank. Interest earned on the funds held in the account. Transfers from another Outward Investment Account (OIA) of the account holder. Remittances received as dividends, proceeds on sale and maturity, capital gains, liquidation proceeds, capital reductions receivable on shares, sovereign bonds, units and debt securities, profits, margins and surplus funds, management fees, consultancy fees and commissions or any other related receipts etc. (including any subsequent shares devolving on the investor by virtue of a corporate action by the issuer, exercise of a right, entitlement or conversion), received in respect of capital transactions undertaken outside Sri Lanka by persons resident in Sri Lanka under a permission granted in terms of the provisions of the Act or the repealed Exchange Control Act, No. 24 of 1953, where such capital transactions have been made out of Personal Foreign Currency Accounts (PFCAs) or Business Foreign Currency Accounts (BFCAs) of the account holder. Permitted Debits Payments (including setting up and maintenance cost, bank charges, broker fees, commissions or any other related payment etc.,) relating to capital transactions (i.e., outward investments) undertaken by the account holder in terms of the permissions granted under the provisions of the Foreign Exchange Act, No. 12 of 2017. Payments in foreign currency outside Sri Lanka for current transactions of the account holder. Transfers to Personal Foreign Currency Accounts (PFCA) and Business Foreign Currency Accounts (BFCA) of the account holder as capital and capital gains received from an overseas capital transaction (i.e., outward investment) into an Outward Investment Account (OIA), where the investment had been made by debiting such Personal Foreign Currency Accounts (PFCA) or Business Foreign Currency Accounts (BFCA). Transactions or transfers to any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by directions issued by the Central Bank. Withdrawals in Sri Lanka Rupees. Transfers to another Outward Investment Account (OIA) of the account holder. Transfers to Rupee Accounts of the account holder. Transfers to Personal Foreign Currency Accounts (PFCA) and Business Foreign Currency Accounts (BFCA) of the account holder out of the dividends, proceeds on sale and maturity, capital gains, liquidation proceeds, capital reductions receivable on shares, sovereign bonds, units and debt securities, profits, margins and surplus funds, management fees, consultancy fees and commissions or any other related receipts etc. (including any subsequent shares devolving on the investor by virtue of a corporate action by the issuer, exercise of a right, entitlement or conversion), received from an overseas capital transaction (i.e., outward investment) into an OIA, where the investment had been made out of the funds transferred into an OIA from such PFCAs or BFCAs or by directly debiting such PFCAs or BFCAs. For more information please visit the nearest branch of People’s Bank or contact us Manager -Foreign Currency Department , People’s Bank, Overseas Customer Services +94 112332745 General Nos: 2332746 / 2334278 / 2437621 / 2446409 Email: nrfc@peoplesbank.lk Special benefits Special benefits: Accounts can be maintained in any designated foreign currency Inward Remittances credited to Accounts free of charge 100% protection on your investments "}