{"url": "https://www.peoplesbank.lk/ctra", "bank": "people", "name": "CTRA", "details": " Persons eligible to open CTRAs An individual Sri Lankan, permanently residing outside Sri Lanka. A Sri Lankan dual-citizen A Foreign National of Sri Lankan origin A Non National resident outside Sri Lanka A Sri Lankan National resident outside Sri Lanka Firms and Companies registered outside Sri Lanka Permitted Credits Remittances in foreign exchange received from outside Sri Lanka in favour of the account holder through the banking system. Where the account holder is an individual emigrant of Sri Lanka, a non-national resident outside Sri Lanka or a Sri Lankan dual citizen; local income including sale proceeds of movable and immovable property and tangible / intangible assets, which are derived in Sri Lanka. Transactions or Transfers from any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by directions issued by the Central Bank. Interest earned in Sri Lanka Rupees on the funds held in the account. Local credits other than funds derived from capital transactions. Where the account holder is an eligible person referred to in items (i-iii) of Paragraph 1 above, superannuation benefits, interest, dividends, pensions, rent, lease rentals and profits or any other approved pension or retirement funds etc. Where the account holder is an eligible person referred to in item (iv) of Paragraph 1 above, sale proceeds of local assets including inherited movable or immovable property. Where the account holder is an eligible person referred to in item (v) of Paragraph 1 above, proceeds of foreign currency or Sri Lanka Rupee loans and advances obtained by the account holder in terms of the provisions of the Act for the purpose of local disbursements. Permitted Debits (a) Remittance of migration allowance up to USD 200,000 per individual in respect of a Sri Lankan emigrant, as per the directions issued by the Central Bank. (b) Remittance of an allowance of USD 30,000 per annum in respect of an eligible Sri Lankan emigrant in addition to the above migration allowance, as per the directions issued by the Central Bank. (c) Remittance of USD 30,000 per annum for capital transactions in respect of foreign nationals as per the directions issued by the Central Bank. (d) Where the account holder is an individual emigrant of Sri Lanka, a Non- National resident outside Sri Lanka or a Sri Lankan dual citizen, transfer of eligible migration allowance to a Personal Foreign Currency Account (PFCA) or an Inward Investment Account (IIA) of the account holder, as per the directions issued by the Central Bank. (e) Disbursements in Sri Lanka in Sri Lanka Rupees. (f) Transaction or Transfers to any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by directions issued by the Central Bank. (g) Any outward remittance in respect of current transactions. (i) Transfer of eligible migration allowance to an account maintained outside Sri Lanka by the eligible persons referred to in items (i-iii) of Paragraph 1 above. (j) Where the account holder is an eligible person referred to in item (vi) of Paragraph 1 above, transfer of accumulated funds derived in Sri Lanka with respect to an underlying current transaction upon verification of agreements, invoices, statements etc. and satisfying bona-fide of such request by the Authorized Dealer. For more information please visit the nearest branch of People's Bank or contact us Manager - Foreign Currency Department , People's Bank, Overseas Customer Services Overseas Customer Services +94 112332745 Email: nrfc@peoplesbank.lk General Nos: 2332746 / 2334278 / 2437621 / 2446409 Special benefits Special benefits: Inward Remittances credited to Accounts free of charge 100% protection on your investments "}