{"url": "https://www.peoplesbank.lk/iia", "bank": "people", "name": "IIA", "details": " Persons eligible to open IIAs A non-national resident in or outside Sri Lanka. A non-national of Sri Lankan origin, who is a resident outside Sri Lanka A Sri Lankan citizen, resident outside Sri Lanka. A Company incorporated outside Sri Lanka. Country and Regional Funds, Mutual Funds, Unit Trusts and other Institutional investors who are established outside Sri Lanka. An administrator or executor of a deceased person, in the name of such deceased person who maintained an Inward Investment Account (IIA) with that authorized dealer until the completion of the administration of the deceased person’s estate. A receiver or liquidator of a Company that maintained an Inward Investment Account (IIA) with that authorized dealer until proceedings are concluded. Any other person or category of persons who may be authorized by the Central Bank from time to time Permitted Credits Remittances in foreign exchange received from outside Sri Lanka in favour of the account holder through the banking system. Transfers from Personal Foreign Currency Accounts, Inward Investment Accounts or accounts maintained in the Offshore Banking Unit of the same account holder. Dividends, sale or maturity proceeds, disposal of liquidation, capital redemption, share buyback, profits, surplus funds, rental income, recovery of principal, interest or any other related income received from capital transactions undertaken in Sri Lanka by persons resident outside Sri Lanka as permitted under the provisions of the Foreign Exchange Act, No. 12 of 2017. Foreign currency brought into Sri Lanka by the account holder upon declaration (i.e., where such foreign currency notes exceed or equals to USD 15,000 or its equivalent in other foreign currency on a declaration to Customs Department or where such foreign currency notes are less than USD 15,000 or its equivalent in other foreign currency on an appropriate declaration to the authorized dealer). Sale proceeds including capital gains, leasehold rights, sub-lease hold rights, if any, received in Sri Lanka Rupees re-designated where such investment had been made through the Inward Investment Account (or through the Securities Investment Account of the account holder or upon ascertaining the proof of inward remittances prior to these regulations come into effect). Transfers from Business Foreign Currency Account of a person resident in Sri Lanka as repayment of foreign currency loans obtained by such person (i.e., borrower) from the account holder (i.e., foreign lender) under a general or special approval granted under the provisions of the repealed Exchange Control Act or Foreign Exchange Act, No. 12 of 2017. Sri Lanka Rupees converted into foreign currency by a resident in Sri Lanka (i.e., borrower) for repayment of foreign currency loans obtained from the account holder (i.e., foreign lender) under a general or special approval granted under the provisions of the repealed Exchange Control Act or Foreign Exchange Act, No. 12 of 2017. Transfers from Diplomatic Foreign Currency Accounts and Diplomatic Rupee Accounts of the same account holder. Transfers from an Inward Investment Account of another person (i.e., buyer) in respect of sale of permitted investments to such buyer by the account holder where such investment has been made by the account holder through the same Inward Investment Account (including any subsequent shares devolving on the investor by virtue of a corporate action by the issuer, exercise of a right, entitlement or conversion). Transfers from Capital Transactions Rupee Account (CTRA) of the same account holder as permitted by Directions issued by the Central Bank. Transactions or Transfers from any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by directions issued by the Central Bank. Interest earned on the funds held in the account. Dividends, proceeds on sale, share buyback and any other related income received from all classes of shares by companies incorporated in Sri Lanka against the value of plant and equipment supplied by the non-resident investor. Permitted Debits Disbursements in Sri Lanka in Sri Lanka Rupees. Outward remittances in favor of the account holder. Transfers to Inward Investment Accounts, Personal Foreign Currency Accounts or accounts maintained in the Offshore Banking Unit of the same account holder. Payments relating to capital transactions undertaken in Sri Lanka by persons resident outside Sri Lanka in terms of the permissions granted under the provisions of the Foreign Exchange Act, No. 12 of 2017. Disbursements relating to foreign currency loans to persons resident in Sri Lanka where such loans have been obtained in terms of a general or special approval granted under the provisions of the Foreign Exchange Act, No. 12 of 2017. Transfer of proceeds of foreign currency loans (including debt securities) to an Outward Investment Account of the borrower, where such loans have been obtained for the purpose of financing an overseas capital transaction (i.e., an outward investment) permitted under the provisions of the Foreign Exchange Act, No.12 of 2017. Transfers to Diplomatic Foreign Currency Accounts (DFCA) and Diplomatic Rupee Accounts (DRA) of the same account holder. (h) Transfers to an Inward Investment Account (IIA) of another person (i.e., seller) in respect of the purchase of any permitted investment from such seller by the account holder. Transactions or Transfers to any other category of accounts that may be permitted to maintain by the Central Bank from time to time, to the extent such transactions or transfers have been permitted by directions issued by the Central Bank. Transfer of proceeds of foreign currency loans (including debt securities) to Business Foreign Currency Accounts (BFCA) held by a person resident in Sri Lanka (i.e. borrower) where such loans have been obtained in terms of a permission granted in terms of the provisions of the Act (excluding loans obtained for the purpose of making capital transactions outside Sri Lanka. For more information please visit the nearest branch of People’s Bank or contact us Manager - Foreign Currency Department , People’s Bank, Overseas Customer Services +94 112332745 General Nos: 2332746 / 2334278 / 2437621 / 2446409 nrfc@peoplesbank.lk Special benefits Special benefits: Inward Remittances credited to Accounts free of charge 100% protection on your investments "}