{"url": "http://www.ndbbank.com/pages/english/individuals/visa_card.jsp", "bank": "ndb", "name": " NDB VISA Debit Card ", "details": "The NDB Debit Card gives you the recognition and flexibility to carry your account with you, wherever you go. This global card gives you unparalleled access to withdraw cash from innumerable ATMs and can be used to make cashless purchases in millions of establishments worldwide. This card facilitates payments without cash or cheques. It is an effective money management tool for all banking individuals-either with or without a credit card. The NDB VISA Debit Card not only allows you to conduct ATM transactions like balance enquiries and cash withdrawals but also provides you with easy access to supermarkets, shopping malls, restaurants and many more merchant establishments locally and internationally. Combining the wide acceptability of a credit card and the thoughtful prudence of an ATM card, this is the most convenient accessory for you. No more fear of overspending. No more searching for the nearest ATM, Offering comfort and convenience specially to you from NDB. Fill in the Debit Card Application and hand it over to the nearest NDB branch or mail it to us. Benefits Allows you to pay for your goods and services all over the world in one currency Safer than cash!! - Need not worry about carrying or losing money 24-hour access to bank (bank-in-wallet) Provides a better cash management Simplifies monthly accounting routines- Purchase gets directly debited to the savings/current account. No fear of over spending -spend up to the limit in the bank account All transaction appear on your bank statement The Visa Debit Card can be used for transactions/payments done through the internet (VbV sites only) Debit Card Tariffs Details Rs. Issuance Fee LKR.400/- Personalization LKR. 750/- (Turnaround time 14 days ) Annual Fees LKR. 300/- ( 2nd Year onwards) Cash withdrawal from NDB ATMs LKR. 5/- Balance inquiry per print out from NDB ATMs LKR. 2/- Card replacement LKR. 400/- PIN replacement LKR. 150/- Cash withdrawal from Lanka Pay ATM Network LKR. 30/- Balance inquiry from Lanka Pay ATM Network LKR. 7.50/- Cash withdrawal from other VISA ATMs Min LKR. 100/- Balance inquiry from other VISA ATMs Min LKR. 50/- Cash withdrawal from Foreign ATMs Min USD. 1.5/- Declined ATM transaction - Insufficient funds (at other ATMs) LKR. 50/- Daily ATM withdrawal limit LKR. 80,000/- Privilege Select Daily ATM withdrawal limit LKR. 200,000/- Daily purchase limit LKR. 150,000/- Privilege Select Daily purchase limit LKR. 250,000/- Fuel Surcharge 2% * Conditions apply Download Debit Card Application Download Other Applications Debit Card Terms and Conditions Sinhala Tamil English Card Dispute Resolution Debit Card User Guide --> Download E-Brochure FAQ"}