{"url": "http://www.ndbbank.com/pages/english/individuals/product_real_saver.jsp", "bank": "ndb", "name": " » Real Saver  ", "details": "Become a Real saver and earn 100% extra interest! If you think saving is not about just putting money in your account, but doing it regularly and continuously, then the Real Saver account is ideal for you. NDB Real Saver account is designed for people who are committed to saving. At NDB we call them the 'Real' savers; who understand the true meaning of saving and adapt it to their lifestyle. They plan for their future with responsibility and care. If you think you are a real saver and are willing to make a commitment to save regularly then we will reward you with 100% extra interest on your savings balance each month. Features and Benefits Accounts can be opened with an initial deposit of Rs.1,000/- A minimum monthly deposit of Rs. 1,000 or above has to be pledged by you at the time of opening an account If the monthly pledged amount or an even higher deposit is made to your Real Saver each month, you will be eligible for the bonus interest of 100% above the standard interest rate. (Failure to send in the pledged deposit to the account in a particular month would mean than you will only earn the standard interest rate that month) Only one withdrawal will be allowed per month. (If more than 1 withdrawal is made from the account you will not be eligible for the 100% bonus interest but will be able to earn the standard in interest rate applicable for normal savings) passbook to track you savings balance You may set up a free standing order to the Real Saver account from another account at NDB SMS and Call reminders monthly if the monthly pledged deposit is not credited, in order to help you stay true to your commitment of saving Access to your account will be made convenient through; Free Internet Banking facility allowing you to check your account balances and monitor if the monthly deposit has been credited. Saturday Banking and 365 day banking at selected braches 24 hour call centre for inquiries on account balance. Only an NDB Real Saver savings account gives you 100% extra interest over the regular interest. Open and account today. * Terms and conditions apply."}