{"url": "http://www.ndbbank.com/pages/english/individuals/home_loan_max.jsp", "bank": "ndb", "name": " NDB Home Loan Max", "details": "This loan is specially designed for the existing home loan clients of NDB. Any individual who wishes to convert an existing housing loan from another financial institution to NDB shall also be eligible up to the existing leeway. It can be obtained for any legitimate purpose at a competitive interest rate. The loan is granted for varied purposes including buying a vehicle or property, improving or expanding your house, financing your child's higher education, wedding expenses, overseas travel and virtually any other legitimate reason of your choice. 75% FORCED SALE VALUE - HOME LOAN OUTSTANDING = NDB HOME LOAN MAX Why should I choose NDB Home Loan Max? NDB Home Loan Max affords you the opportunity to maximize your existing home loan with NDB enabling you to fulfill your life's expectations while repaying your existing home loan. Facilities are flexible and tailor-made to suit your requirements depending on your repayment capacity. What is the eligibility criteria? Any Sri Lankan citizen between the ages of 18 &amp; 55 years with a fixed income (permanent employment), self-employed or with a professional practice is eligible for this Loan. The loan can also be obtained by non-resident Sri Lankans employed overseas, subject to exchange control regulations. How much can I borrow? The Loan amount will depend upon each individual's repayment capacity up to a maximum of LKR 10 Mn. What would be the security? Your Loan can be secured through the same property already mortgaged to the bank for your home loan. Can I afford it? NDB Home Loan Max will be offered at very competitive interest rates. You may contact your nearest branch or call 011 244 8888 for details. Can I obtain the loan jointly with my spouse? NDB Home Loan Max can be obtained individually or as a joint loan with your spouse, Do I need to obtain a Loan protection cover? Yes. A mortgage protection cover needs to be obtained to protect your dependents and ease their burden in the event of an unlikely death or permanent disability. What documentation do I need to submit? Certified last extract from the land registry Local authority Certificates obtained within the last 6 months. (Non-Vesting, Street Line Certificate, Ownership Certificate, Tax Receipt for the Last Quarter)"}