{"2": {"url": "http://www.ndbbank.com/pages/english/individuals/personal_loans.jsp", "details": " What can you do with a Dream Maker personal loan? You can buy a small piece of land, have a grand wedding, renovate your house, upgrade your car and do just about anything else; after all it's a loan for anything! Why should I choose Dream Maker? Well unlike most loans, you don't need any security or guarantors, the documentation is simple and without any of the usual hassle, plus it's quick cash. In short, it's the simplest way to get a loan. How do I become eligible for a Dream Maker personal loan? Work in an establishment accepted by NDB. Be confirmed at your current job with a salary of Rs.35,000/- Provide proof that your salary has been credited to a bank account for at least 3 months. Be between the ages 18 to 55 years. How much can I borrow? Loan amounts will range from Rs.100,000 upwards, depending on your repayment capacity. We at NDB understand your requirment and provide costomized solutions. Can I afford a Dream Maker personal loan? Well, you can pay it over a period of 5 years, while you get the best rates in the market. There is only a one time arranging fee, so it's as affordable as it could be. Apply Online Now! or Download Application Forms (Click here to view Interest Rates) Visit the nearest NDB branch or call +94 11 244 8888 * Conditions apply "}, "3": {"url": "http://www.ndbbank.com/pages/english/individuals/hire_purchase.jsp", "details": " Customers can now obtain a financing facility to purchase a registered vehicle without a hassle! NDB has abolished the need for guarantors and initial monthly installments, while the facility is granted in one day! Allowing you to drive away with your vehicle. This facility is available for those who wish to purchase a vehicle registered in Sri Lanka for more than one year. (Click here to view Interest Rates) What types of registered vehicles are eligible to obtain a hire purchase facility? Lorries Double cabs Trucks Buses Vans Cars Jeeps Why should you obtain a hire purchase facility from NDB? Competitive interest rates Minimum documentation One day service What are the benefits you will get from NDB? Fixed installment Tailor-made repayment terms to suit your cash flow needs Discounted insurance premium for all assets leased Easy access to other banking products of NDB Efficient and personalized service Who can apply for a hire purchase facility from NDB? An entrepreneur A business enterprise A professional A salaried employee Self-employed individuals How do I apply for a hire purchase facility? Contact the nearest NDB branch and collect your application. Submit the complete application along with the required documents to NDB "}, "4": {"url": "http://www.ndbbank.com/pages/english/individuals/pawning.jsp", "details": " Obtaining cash advances against your gold jewellery, gold biscuits or gold coins can often be the quickest and most convenient method for obtaining short-term finance. NDB’s Ran Naya Pawning service offers you, speedy, reliable and confidential service, coupled with a hassle free operation and utmost security for your Gold. Benefits Pawning service is available at 66 NDB branches Redemptions can be made even by part payments * Conditions Apply Advance rates per sovereign Advance Value (Rs.) 24 karat Gold 42,600.00/- 22 karat Gold 38,000.00/- * As at 08.06.2018 » View Pawning Branch List » Promotion Eligibility Sri Lankan Citizens over 18 years of age who own gold or gold jewellery. (Click here to view Interest Rates) Pawing Interest rate 19% P.a "}, "5": {"url": "http://www.ndbbank.com/pages/english/individuals/fixed_deposits.jsp", "details": " Maximise your interest earnings with short-term investments that carry a high yield. You'll find our rates on fixed deposits very competitive. Convenience Convenient Automatic renewal of your deposit, according to your renewal instructions at time of placement. Make changes to your settlement instructions by giving us two working days notice prior to the maturity date. Flexibility Fixed deposits can be staggered to facilitate several maturity dates so that funds can be available as needed. Obtain an overdraft against your 12 or 24 month fixed deposit, of up to 90% (minimum Rs. 100,000) of the value of your investment, so you wont need to break your deposit unnecessarily. In an emergency you can uplift your FD prematurely, and still earn some interest for the actual duration of the investment at a lower rate determine by the bank. Interest will be paid at maturity, with the option of monthly interest for a 12 or 24 month FDs. Safe Deposit Locker You will be entitled to a safe deposit locker* at a nominal rental, if you open a 12 or 24 month Fixed Deposit for Rs. 1,000,000. Click here for more details. *subject to availability Investment Options Choose from deposit terms ranging from 1 month to 3, 6, 12 , 24, 36, 48 and 60 months in duration. To open a fixed deposit, you will need A minimum investment of Rs. 100,000 for 1, 36, 48 or 60 months duration and Rs. 10,000 for a 3, 6, 12 or 24 month deposits. A copy of your National Identity Card or a valid Passport. Withholding tax is payable on interest earned as specified by the Department of Inland Revenue Click here to view Interest Rates "}, "6": {"url": "http://www.ndbbank.com/pages/english/individuals/foreign_accounts.jsp", "details": " Take advantage of currencies that appreciate against the Rupee, and enjoy attractive interest rates, by saving in foreign currency. RFC - Resident Foreign Currency Accounts - for Sri Lankan nationals residing in Sri Lanka NRFC - Non-resident Foreign Currency Accounts - for Sri Lankan nationals employed abroad. RNNFC - Resident Non-national Foreign Currency Accounts - for residents of Sri Lanka who are not Sri Lankan nationals. Benefits You are free to remit out funds without prior approval from Exchange Control. You can maintain your funds in any foreign currency approved by the Central Bank of Sri Lanka, and convert to rupees as and when you wish. No withholding tax is charged on interest earned. Get a Rupee overdraft facility against your 12 month foreign currency fixed deposit, of up to 90% of your deposit (Minimum of Rs. 100,000). Interest Interest is calculated on daily balance and credited monthly Safe Deposit Locker You will be entitled to a safe deposit locker* at a nominal rental, provided an average balance of the equivalent of Rs. 250,000/- is maintained in your foreign currency savings account, or a minimum of the equivalent of Rs. 1,00,000/- in Fixed Deposits. Click here for more details. *subject to availability Foreign Currency Account The bank offers Foreign Currency Current / Savings and Fixed Deposit accounts which could be opened and maintained, subject to prevailing Exchange Control regulations. Click here to view Interest Rates "}, "7": {"url": "http://www.ndbbank.com/pages/english/individuals/current_accounts.jsp", "details": " The easy way to manage your funds With an NDB current account you are on your way to managing your funds with ease. It's the most flexible way to handle your money day to day. Easy Access Your Personalised Cheque Book will be ready within one working day of opening your account. Have easy access to your account through a NDB VISA Debit Card and receive the option of a paper statement or e-statement. Bank at your convenience where ever you are, through NDB Online our Internet Banking Service or Download the NDB Mobile Banking app for Mobile Banking. Standing Orders Arrange for regular payments to be made on the required dates so you can sit back and relax. Statement Frequency We also offer you the flexibility of choosing your own statement frequency - weekly, monthly, bi-monthly etc. To open an account, you will need A minimum initial deposit of Rs. 15,000/- for individual account and a minimum initial deposit of Rs.25,000/- for SME and Corporate Accounts. A copy of your National Identity Card or a valid Passport A letter of introduction or banker's reference Personal interview with the branch manager Maintain an average monthly balance of Rs. 15,000/- to be exempt from a Rs. 500/- service fee. "}, "8": {"url": "http://www.ndbbank.com/pages/english/individuals/savings_accounts.jsp", "details": " Savings Regularly putting money aside to meet your short-term and long-term goals makes sense. Saving now with NDB Bank can help your dreams become a reality in the future. NDB is here to help you achieve your goals with a variety of savings options to suite your needs. Your Savings Accounts have been renamed with effect from 01 st October 2015 Big Saver Easy Saver The below table illustrates the current and new account name. Current Name New Name Savings Account Regular Easy Saver Savings Account Special Flexi Savings Account Premium Plus Savings Savings Star Savings Account Savings Star Plus Big Saver Please click here to view the applicable interest rates. NOTE Minimum account opening deposit requirement Easy Saver - LKR. 1,000 Big Saver - LKR. 25,000. Interest shall be calculated on a daily basis and credited at the end of the month. Interest will be paid for all accounts which maintain a minimum balance of LKR 1,000 All new accounts opened would be given the option of receiving a printed statement or an e-Statement. Accounts for Normal Saver Easy Saver Account for High Value Saver Big Saver Savings Real Saver Vishmitha Children Savings Shilpa Savings Why you should save ? Save for an emergency (an unexpected financial event ) Save to upgrade your lifestyle (buy a new house, a car, go on a vacation or your children’s education) Ways to Increase Your Savings How Much Money Should I Save? Everyone makes a different amount each month. They also have different financial obligations each month. It is important to realize that one set rupee amount is not going to work for everyone. Here are some basic guidelines you should follow when determining how much you should save each month. The standard that many experts set is at least ten percent of your income each other. This is a good starting point, to save ten percent of your salary. It is not an easy way to start, because it is a set amount of money each month. You should be determine to save this amount regularly . You should set a side this amount before you determine on your spending Income – savings =what left for expenses You may also want to work on increasing the amount you save each month. It is not unreasonable to begin saving twenty percent of your income or even more each month. If you make a significant more than you need to live each month, then you really should save a lot of money. It is also important to remember to give as well. Once you begin saving your money, you should give it a purpose. For example you should have three to six months of living expenses set aside in an emergency fund . Then you may set aside a portion to save for retirement. Many experts say that you should strive for fifteen percent each month for retirement alone. Then you may set aside money for a vacation or a new home. After that you may have some that you save just to build your wealth. Savings Goals - How Can I Increase the Amount I Save? It is important to set tangible goals when it comes to saving money and building wealth . Your savings goals can help you to achieve your dreams. You can save money to buy a house or to travel abroad, or to retire early. The amount of wealth you build now will help you to live more comfortably when you are older. It can also put you in a place to help your children when they are grown. How to Set and Reach Savings Goals The first step in reaching your savings goals is to set attainable and realistic goals. You may want to start with small goals and slowly increase how much you save each month. It is also important to reward your milestones. This can help motivate you to continue to save even when it is difficult. Careful planning and discipline can help you to reach your goals much more quickly. Set a dollar amount you want to save each month by the end of the year, and slowly raise your savings by Rs 1000.each month to begin to reach your goals. \"Ithuru Karana Maga\" (Easy Ways to Save Money) Sinhala Booklet Tamil Booklet Savings Calculator &raquo; How Much Money Should I Save? Everyone makes a different amount each month. They also have different financial obligations each month. It is important to realize that one set rupee amount is not going to work for everyone. Here are some basic guidelines you should follow when determining how much you should save each month. The standard that many experts set is at least ten percent of your income each other. This is a good starting point, to save ten percent of your salary. It is not an easy way to start, because it is a set amount of money each month. You should be determine to save this amount regularly . You should set a side this amount before you determine on your spending Income – savings =what left for expenses You may also want to work on increasing the amount you save each month. It is not unreasonable to begin saving twenty percent of your income or even more each month. If you make a significant more than you need to live each month, then you really should save a lot of money. It is also important to remember to give as well. Once you begin saving your money, you should give it a purpose. For example you should have three to six months of living expenses set aside in an emergency fund . Then you may set aside a portion to save for retirement. Many experts say that you should strive for fifteen percent each month for retirement alone. Then you may set aside money for a vacation or a new home. After that you may have some that you save just to build your wealth. &raquo; Savings Goals - How Can I Increase the Amount I Save? It is important to set tangible goals when it comes to saving money and building wealth . Your savings goals can help you to achieve your dreams. You can save money to buy a house or to travel abroad, or to retire early. The amount of wealth you build now will help you to live more comfortably when you are older. It can also put you in a place to help your children when they are grown. How to Set and Reach Savings Goals The first step in reaching your savings goals is to set attainable and realistic goals. You may want to start with small goals and slowly increase how much you save each month. It is also important to reward your milestones. This can help motivate you to continue to save even when it is difficult. Careful planning and discipline can help you to reach your goals much more quickly. Set a dollar amount you want to save each month by the end of the year, and slowly raise your savings by Rs 1000.each month to begin to reach your goals. &raquo; Easy Ways to Save Money (Ithuru Karana Maga) &raquo; Savings Calculator --> "}, "10": {"url": "http://www.ndbbank.com/pages/english/individuals/ndb_travel_pal.jsp", "details": " Travel the world conveniently with NDB TRAVELPAL Introducing the Visa Card that's every traveller's companion! Before you take off, make sure you secure your currency in an NDB Travel Pal which is PIN and Chip protected.This unique card is indeed every traveller’s friend and companion because it’s secure, convenient, and allows you to manage your finances effectively. The NDB TRAVELPAL allows you to choose out of five main currencies giving you more options and convenience. You can load any of the following five currencies to your card. USD - US Dollars GBP - British Pounds AUD - Australian Dollars EUR - Euros SAR - Saudi Riyals Revised Fee Structure Product Feature Fee Annual Fee Free of Charge Validity Period 3 Years Issuance Fee - Non Personalized Card USD 2 Issuance Fee - Personalized Card USD 5 Top Up Fee 1.00% Refund Fee - Over the counter USD 1 Card Re-issuance/renewal Fee USD 1 PIN Re-issuance Fee USD 1 International ATM Cash withdrawal - Per transaction USD 2 International ATM Balance Inquiry - Per inquiry USD 1 Local Cash withdrawal - Per transaction *Not Allowed Local Balance Inquiry - NDB ATM USD 1 SMS Alert Fee Free of Charge Free Travel Insurance Policy - Entitled Minimum Load USD 100 Maximum Loading / Re- Loading Amount USD 10,000 Minimum Loading/Re- Loading Amount USD 100 Transactional Limit Daily POS Transaction Limit USD 5,000 Daily ATM Withdrawal Limit USD 1,000 * As per Central Bank of Sri Lanka regulations Download Application Terms and conditions Frequently asked questions Travel Insurance Policy Insurance Claim Form Insurance Claim Procedure Travel Insurance - Declaration Form on Good Health (Age 65 to 70) Web Portal - Customer Guide Contacts us : +94 11 244 8888 "}, "11": {"url": "http://www.ndbbank.com/pages/english/individuals/savings_accounts_landing.jsp", "details": " We go that extra mile to save those extra funds for you Choose from three types of accounts, to suit your needs while maximizing your savings. Easy Saver - Maintain a minimum balance of just Rs. 1,000 to earn interest with the flexibility of unlimited withdrawals. Have easy access to your account through a NDB VISA Debit Card and receive the option of a paper statement or e-statement. Download the NDB Mobile Banking app and Bank at your convenience. Big Saver - Maintain a minimum balance over Rs. 50,000 to earn high interest with flexibility of unlimited withdrawals. Have easy access to your account through a NDB VISA Debit Card and receive the option of a paper statement or e-statement. Download the NDB Mobile Banking app and Bank at your convenience. Real Saver - Make a minimum deposit of Rs.1,000 every month to earn 100% extra interest on your balance. Vishmitha - Enjoy the unique opportunity to obtain an interest free loan on your account balance while earning Interest on your savings. Rattharan - Reserve Gold at today&rsquo;s price and paying installments --> Children Savings - Children’s savings attractive gifts scheme and attractive interest rate when you save for your little one. Open an account with Rs.500/= Interest Rates (Click here to view Interest Rates) Interest is calculated on daily balance and credited monthly Tax Withholding tax is payable on interest earned as specified by the Department of Inland Revenue. Easy Access Access your account from wherever you are, through the NDB Visa Debit Card , Mobile Banking and Internet Banking. "}, "15": {"url": "http://www.ndbbank.com/pages/english/individuals/bancassurance.jsp", "details": " Insurance plans for life's varying needs NDB's partnership with AIA Sri Lanka enables customers of NDB to benefit from AIA's life insurance solutions, in addition to a wide range of banking services. These plans are issued and underwritten by AIA Insurance Lanka PLC and are designed to suit life's varying needs, and include insurance solutions for; Fund building Retirement Savings Child education Health insurance Download our brochures for more information! AIA Education Plan AIA Fund Builder 10 AIA Health Insurance AIA Investment Plans AIA Pensions Plus AIA Pensions AIA Protected Savings About AIA Sri Lanka AIA entered Sri Lanka further expanding its Pan- Asian leadership position by acquiring AVIVA NDB Insurance – now known as AIA Insurance Lanka PLC. AIA Group Limited and its subsidiaries (collectively \"AIA\" or \"the Group\") comprise the largest independent publicly listed pan-Asian life insurance group. It has wholly-owned main operating subsidiaries or branches in 17 markets in Asia Pacific - in Hong Kong, Thailand, Singapore, Malaysia, China, Korea, the Philippines, Australia, Indonesia, Taiwan, Vietnam, New Zealand, Macau, Brunei, a 97 per cent subsidiary in Sri Lanka, a 26 per cent joint-venture in India and a representative office in Myanmar. AIA is the market leader in the Asia-Pacific region (ex-Japan) based on life insurance premiums and holds leading positions across the majority of its markets. With AIA, customers benefit from the strength, security and certainty of being part of the AIA Group, with many decades of experience and leadership in the Asia Pacific region. "}, "16": {"url": "http://www.ndbbank.com/pages/english/individuals/product_real_saver.jsp", "details": " Become a Real saver and earn 100% extra interest! If you think saving is not about just putting money in your account, but doing it regularly and continuously, then the Real Saver account is ideal for you. NDB Real Saver account is designed for people who are committed to saving. At NDB we call them the ‘Real’ savers; who understand the true meaning of saving and adapt it to their lifestyle. They plan for their future with responsibility and care. If you think you are a real saver and are willing to make a commitment to save regularly then we will reward you with 100% extra interest on your savings balance each month. Features and Benefits Accounts can be opened with an initial deposit of Rs.1,000/- A minimum monthly deposit of Rs. 1,000 or above has to be pledged by you at the time of opening an account If the monthly pledged amount or an even higher deposit is made to your Real Saver each month, you will be eligible for the bonus interest of 100% above the standard interest rate. (Failure to send in the pledged deposit to the account in a particular month would mean than you will only earn the standard interest rate that month) Only one withdrawal will be allowed per month. (If more than 1 withdrawal is made from the account you will not be eligible for the 100% bonus interest but will be able to earn the standard in interest rate applicable for normal savings) passbook to track you savings balance You may set up a free standing order to the Real Saver account from another account at NDB SMS and Call reminders monthly if the monthly pledged deposit is not credited, in order to help you stay true to your commitment of saving Access to your account will be made convenient through; Free Internet Banking facility allowing you to check your account balances and monitor if the monthly deposit has been credited. Saturday Banking and 365 day banking at selected braches 24 hour call centre for inquiries on account balance. Only an NDB Real Saver savings account gives you 100% extra interest over the regular interest. Open and account today. * Terms and conditions apply. "}, "17": {"url": "http://www.ndbbank.com/pages/english/individuals/safe_deposit_lockers.jsp", "details": " NDB Safe Deposit Lockers are available at most of our branches, in three sizes, to suit your needs. View: Tarrif booklet Subject to availability of lockers at the time of the request, an up-front annual rental fee will be charged and the subsequent annual rentals will be charged to your current or savings account under standing order instructions from you. "}, "18": {"url": "http://www.ndbbank.com/pages/english/individuals/visa_card.jsp", "details": " The NDB Debit Card gives you the recognition and flexibility to carry your account with you, wherever you go. This global card gives you unparalleled access to withdraw cash from innumerable ATMs and can be used to make cashless purchases in millions of establishments worldwide. This card facilitates payments without cash or cheques. It is an effective money management tool for all banking individuals-either with or without a credit card. The NDB VISA Debit Card not only allows you to conduct ATM transactions like balance enquiries and cash withdrawals but also provides you with easy access to supermarkets, shopping malls, restaurants and many more merchant establishments locally and internationally. Combining the wide acceptability of a credit card and the thoughtful prudence of an ATM card, this is the most convenient accessory for you. No more fear of overspending. No more searching for the nearest ATM, Offering comfort and convenience specially to you from NDB. Fill in the Debit Card Application and hand it over to the nearest NDB branch or mail it to us. Benefits Allows you to pay for your goods and services all over the world in one currency Safer than cash!! - Need not worry about carrying or losing money 24-hour access to bank (bank-in-wallet) Provides a better cash management Simplifies monthly accounting routines- Purchase gets directly debited to the savings/current account. No fear of over spending –spend up to the limit in the bank account All transaction appear on your bank statement The Visa Debit Card can be used for transactions/payments done through the internet (VbV sites only) Debit Card Tariffs Details Rs. Issuance Fee LKR.400/- Personalization LKR. 750/- (Turnaround time 14 days ) Annual Fees LKR. 300/- ( 2nd Year onwards) Cash withdrawal from NDB ATMs LKR. 5/- Balance inquiry per print out from NDB ATMs LKR. 2/- Card replacement LKR. 400/- PIN replacement LKR. 150/- Cash withdrawal from Lanka Pay ATM Network LKR. 30/- Balance inquiry from Lanka Pay ATM Network LKR. 7.50/- Cash withdrawal from other VISA ATMs Min LKR. 100/- Balance inquiry from other VISA ATMs Min LKR. 50/- Cash withdrawal from Foreign ATMs Min USD. 1.5/- Declined ATM transaction - Insufficient funds (at other ATMs) LKR. 50/- Daily ATM withdrawal limit LKR. 80,000/- Privilege Select Daily ATM withdrawal limit LKR. 200,000/- Daily purchase limit LKR. 150,000/- Privilege Select Daily purchase limit LKR. 250,000/- Fuel Surcharge 2% * Conditions apply Download Debit Card Application Download Other Applications Debit Card Terms and Conditions Sinhala Tamil English Card Dispute Resolution Debit Card User Guide --> Download E-Brochure FAQ "}, "19": {"url": "http://www.ndbbank.com/pages/english/individuals/housing_loans.jsp", "details": " At NDB we are committed to provide total housing loan solutions to our customers. We offer both retail and corporate services and provide an efficient, speedy and a personalised service. NDB Home Loans 'Viyana' Home Loan - Exclusively for ETF Members Corporate Loans Loans to Self Employed NDB Home Loan Max NDB Tie up with Nivasie "}, "21": {"url": "http://www.ndbbank.com/pages/english/individuals/tie_up_with_nivasi.jsp", "details": " NDB Tie up with Nivasie NDB partnered with Nivasie Developers to provide a valuable offer on the developer's latest project - 'Orchid Malabe' (Phase II). The two parties signed an MOU recently, marking the beginning of a relationship that would offer better value and unique benefits to those seeking for a prime living space or a real estate investment. With the partnership between Nivasie and NDB, prospective home buyers will enjoy an attractive interest rate on their NDB home loans reserving a desired living space at the 'Orchid Malabe'. www.orchidbynivase.com "}, "22": {"url": "http://www.ndbbank.com/pages/english/individuals/home_loan_max.jsp", "details": " This loan is specially designed for the existing home loan clients of NDB. Any individual who wishes to convert an existing housing loan from another financial institution to NDB shall also be eligible up to the existing leeway. It can be obtained for any legitimate purpose at a competitive interest rate. The loan is granted for varied purposes including buying a vehicle or property, improving or expanding your house, financing your child’s higher education, wedding expenses, overseas travel and virtually any other legitimate reason of your choice. 75% FORCED SALE VALUE - HOME LOAN OUTSTANDING = NDB HOME LOAN MAX Why should I choose NDB Home Loan Max? NDB Home Loan Max affords you the opportunity to maximize your existing home loan with NDB enabling you to fulfill your life’s expectations while repaying your existing home loan. Facilities are flexible and tailor-made to suit your requirements depending on your repayment capacity. What is the eligibility criteria? Any Sri Lankan citizen between the ages of 18 &amp; 55 years with a fixed income (permanent employment), self-employed or with a professional practice is eligible for this Loan. The loan can also be obtained by non-resident Sri Lankans employed overseas, subject to exchange control regulations. How much can I borrow? The Loan amount will depend upon each individual’s repayment capacity up to a maximum of LKR 10 Mn. What would be the security? Your Loan can be secured through the same property already mortgaged to the bank for your home loan. Can I afford it? NDB Home Loan Max will be offered at very competitive interest rates. You may contact your nearest branch or call 011 244 8888 for details. Can I obtain the loan jointly with my spouse? NDB Home Loan Max can be obtained individually or as a joint loan with your spouse, Do I need to obtain a Loan protection cover? Yes. A mortgage protection cover needs to be obtained to protect your dependents and ease their burden in the event of an unlikely death or permanent disability. What documentation do I need to submit? Certified last extract from the land registry Local authority Certificates obtained within the last 6 months. (Non-Vesting, Street Line Certificate, Ownership Certificate, Tax Receipt for the Last Quarter) "}, "23": {"url": "http://www.ndbbank.com/pages/english/individuals/self_employed.jsp", "details": " NDB has a housing loan scheme that will cater to the self-employed, looking for a loan for the purpose of ready purchase, construction, extension, improvement of a house or to top-up an existing housing loan. With an attractive interest rate and with a minimum loan amount from Rs 500,000/- this scheme offers the borrower the ability to match his income with the repayment by giving him greater flexibility and safety. A further boost would be the period of repayment, which can be extended up to a maximum of 10 years with equated installments. * Subject to terms and conditions applicable. Apply Online Now! "}, "24": {"url": "http://www.ndbbank.com/pages/english/individuals/corporate_loans.jsp", "details": " NDB has geared itself to cater to the Corporates who wish to provide for the welfare of their work force by providing special staff loan schemes, where the employer subsidies a part of the interest cost. The bank also considers a reduction in the interest rate, evaluated on a case by case basis. Several blue chip companies have already tied up with the Bank, to provide their employees with such facilities as part of the remuneration package. Apply Online Now! "}, "25": {"url": "http://www.ndbbank.com/pages/english/individuals/viyana.jsp", "details": " Making the wish of having your own home a reality, the Viyana home loan scheme comes to you as a joint initiative between NDB and the Employee Trust Fund Board. If you are a resident of Sri Lanka with 5 years of uninterrupted ETF membership and currently employed at an organization that is pre-cleared/approved by NDB, the home loan scheme offers a range of loan options from ready purchase to construction, from adding an extension to home improvement, for a maximum of Rs. 1,500,000/-. Exclusive Interest rates for ETF Members Upto Rs. 250,000/- 10.50% Rs. 250,000 - 750,000 11.50% Rs. 750,000 - 1,500,000 12.00% ( * Only ETF members with 5 years of contribution to the ETF and a balance stipulated by the ETF are eligible to apply.) NDB also provides you the flexibility of structuring your loan up to a maximum period of 20 years, depending on your date of retirement at a very concessionary interest rate (subject to government taxes) with the loan being secured by the mortgage over property in favour of NDB. You have the convenience of the payment being deducted from your pay sheet, based on the undertaking of your employer and yourself. Thereby eliminating the hassle associated with repayment. So, come to NDB for your housing loan requirements, be it for a fresh loan, to redeem an existing loan or even to top-up an existing loan. We will also be glad to entertain requests for loan amounts greater than Rs. 1,500,000/-, at the normal lending rates of NDB. Apply Online Now! "}, "26": {"url": "http://www.ndbbank.com/pages/english/individuals/ndb_home_loan.jsp", "details": " NDB home loan is the ideal product to choose if you are looking for a loan to construct, ready purchase, add on an extension, and improve your home or even to purchase a land of your own to build a house. With a maximum repayment period of up to 20 years based on your date of retirement at a loan amount starting from a minimum of Rs. 100,000/- and reaching a maximum to suit your budget, age and repayment capacity. You have the choice of structuring the loan to suit your repayment capacity and repay the loan by means of a pay sheet deduction carried out by your employer or any other mode of payment acceptable to the bank. With equated loan installments and the ability to mortgage the property being purchased, used for construction or provide any other security acceptable to the bank an NDB home loan is the correct choice for you. Home Construction If you already own a land on which you wish to build your dream home NDB will assist you by providing 100% of the Construction Cost, subject to a maximum of 75% of the bank’s valuation of your property. Home Purchase Have you come across the house of your dreams and do you need assistance to purchase it? Then turn to a NDB home loan and get up to 80% of the bank’s valuation of the house &amp; property as a loan to purchase your future home. Home Extension Are you still pondering on how to manage adding an extension to your house? Select an NDB home loan and get the funds needed (100% of the Construction Cost) subject to a maximum of 75% of the bank’s valuation on your property, to suit your requirement. Home Improvement Opt for an NDB home loan and get up to 100% of the Improvement Cost, subject to a maximum of 75% of the bank’s valuation of your property to add that extra bit of personal touch that will make your home your castle. Land Purchase Loan Have you laid eyes on the land that you see as the location for your future home and are you looking at means of purchasing it? NDB with its home loan options provides you the means, subject to a maximum 70% of the bank’s valuation of the property, to make your vision a reality. NRSL Loan NDB offers Non Resident Sri Lankans, with permanent employment contracts abroad and earning a minimum salary equivalent to Rs. 50,000/-, an opportunity to obtain an NDB home loan for the purchase, construction, or improvement of a house. You can obtain a loan starting from a minimum amount of Rs. 500,000/- subject to a maximum repayment period of 5 years. Apply Online Now! "}, "28": {"url": "http://www.ndbbank.com/pages/english/individuals/indviduals.jsp", "details": " NDB personal banking products have been tailor made to offer you a range of investment options and benefits that ensures you the highest returns. With competitive rates, a rapidly expanding branch network, and a multitude of delivery channels including VISA Debit cards and internet banking we provide you a host of convenient ways to keep in touch with your account whenever you want, from wherever you are. With a comprehensive product and service options to choose from we guarantee the very best in customer service for whatever product or service you pick from our portfolio. Vismitha Savings Account NDB Achara Araliya Savings Account Business Banking NDB Children's Savings Account NDB Savings Planner One Account --> NDB Travel Pal NDB Shilpa NDB Salary Max Privilege Select Solar Vantage Dial Banking Privilege Banking Savings Accounts Current Accounts Foreign Currency Accounts Fixed Deposits Pawning NDB Leasing » Registered Vehicles Personal Loans Housing Loans Educator Loans NDB VISA Debit Card NDB Credit Cards Safe Deposit Lockers Remittances Bancassurance --> Bancassurance "}, "29": {"url": "http://www.ndbbank.com/pages/english/individuals/remittances.jsp", "details": " Sri Lankans working or living abroad could remit funds to their own accounts or to their loved ones at home through the following NDB money transfer services. Western Union Money Transfer: Western Union Money Transfers through their agents spread across the globe, facilitates the sending of money instantly, to any NDB branches and its' agents; namely Singer Sri Lanka, Regional Development Bank , Vision Care and Union Chemist branches located throughout the country. » Reliability Western Union has offered electronic money transfer for over 150 years. Each transfer can be tracked electronically to make sure that only you get the money your loved one has sent you. » Speed Western Union uses advanced technology and has a unique worldwide computer network to makes sure you receive your money in minutes * » Convenience You don't have to travel very far! Now, all NDB branches across Sri Lanka offer Western Union Money Transfer service. » Receive Money in 3 easy steps Sender goes to any Western Union location in the world and deposits the money. He/She gets a Money Transfer Control Number (MTCN) He/she informs receiver about the amount of money sent and the Money Transfer Control Number (MTCN) Go to the nearest NDB branch or its agents namely Singer Sri Lanka or Regional Development Bank and their branches that offer the Western Union Money Transfer service with a valid identification and Money Transfer Control Number (MTCN). Fill a simple form and receive the money sent, within minutes*, without charges. * Subject to hours of operation, difference in time zone and applicable terms and conditions Inward Remittances Remittance of funds to Sri Lanka for payment of cash at counters of NDB network and credit to beneficiary accounts with NDB and other banks in Sri Lanka could be effected conveniently through the following Remittance Companies abroad. Remittances from Australia Ceylon Exchange Pty Ltd Company : Ceylon Exchange Pty Ltd Address : 18A / 75-77 Auburn Rd, Auburn, NSW, 2144, Australia. Telephone Number : +61 29 749 7775 Fax : +61 29 749 5586 E Mail : Mafaz@ceylonexchange.com.au Web : www.ceylonexchange.com.au Back to Top Sri Cash Name : Sri Cash Address : No 29 Brownie Street, Jamboree Heights, Queensland, Australia 4074 Contact : Madhawa Gamage Tel : +61 73 376 6571 Mobile : + 61 43 123 1231 Fax : + 61 73 376 6571 Email : Madhawa.Gamage@hotmail.com Web : www.Sricash.com.au Remittances from Italy National Exchange Company s.r.l (NEC) Head Office : National Exchange Company s.r.l. Address : Via Ferruccio, 30, Rome,00185, Italy Tel : +39 06 4 434 1221 Email : necid@nationalexchange.it Web : www.nationalexchange.it Toll Free : 800090207 Remittances from UAE UAE Exchange Centre LLC Company : UAE Exchange Centre LLC Address : P O Box 170, Abu Dhabi, U.A.E Tel : +97 12 610 5555 Fax : +97 12 632 1767 Email : customer.care@uaeexchange.com Web : www.uaeexchange.com Online portal : www.money2anywhere.com Click to View Photograph --> Delma Exchange Company : Delma Exchange Address : P O Box 129869, 304, Al Montazah Tower, Zayed The First Street, Khalidiya, Abu Dhabi, UAE Tel : +97 1 2 491 5757 Fax : +97 1 2 491 5756 Mobile : +97 15 283 10664 Email : info@delma-exchange.com Web : www.delma-exchange.com Details of NDB Representatives stationed overseas Country : United Arab Emirates Name of the Representative : Dilshan Angelo Tel : 0097 152 831 0664 Email : dilshan.angelo@ndbbank.com Stationed address : Delma Exchange - Musaffah Branch Shop No.41 Al Madeena Hyper Market ICAD City, Musaffah. <!-- 2015.03.24 Sri Cash remove 2015.03.24 --> Index Exchange LLC Company : Index Exchange LLC Address : Shop No.1, 2 &amp; 3, Knaish Khalifa Knaish Al Qubaisi Building, Sheikh Hamdan Street, Opposite Home Centre, P. O. Box No.2370, Abu Dhabi, U.A.E. Contact : Mr. Milan Goonetilleka - Manager Tel : +97 12 627 2656 Fax : +97 12 627 2318 E Mail : info@indexexchange.ae Web : www.indexexchange.com /* Demo Styles */ .wrap { width: 600px; margin: 0 auto; } #QAccess:hover{ color:#F00; cursor:pointer; } #Icom:hover{ color:#F00; cursor:pointer; } #rates:hover{ color:#F00; cursor:pointer; } $(document).ready(function($){ $('#QAccess').click(function(){ window.open('/pages/english/quick_access/quck_access_main.jsp','_parent'); }); $('#Icom').click(function(){ window.open('/pages/english/invstr_and_comnty_rlatins/invt_com_rel_main.jsp','_parent'); }); $('#rates').click(function(){ window.open('/pages/english/rates/rates_main.jsp','_parent'); }); }); Quick Access » Notices » Contact Us » Applications » Share your feedback » Promotions » Branch/ATM Locator » Customer Charter » CSR Image Gallery » Bank Holidays » e-Statements » Financial Ombudsman » NDB Mobile Banking Rates » Exchange Rates » Service Charges » Interest Rates on Deposits » Interest Rates On Advances Community Relations » About NDB » Sustainability » Reports » Cinnamon to the World &raquo; Awards --> Share Price &raquo; Date: &raquo; Opening: &raquo; Closing: &raquo; Quantity: » Date : 2018-08-13 » Opening : 116.00 » Closing : 115.00 » Quantity : 5,928 » High : 116.40 » Lowest : 115.00 ©Copyright 2007 - 2017 National Development Bank PLC. All Rights Reserved. Solutions by MI-Synergy (pvt) Ltd. "}, "31": {"url": "http://www.ndbbank.com/pages/english/individuals/education_loan.jsp", "details": " Education Loan Pursue your higher education in any field or profession of your choice with NDB Educator, a loan scheme that allows you to pay only the loan interest while you study and pay off the loan capital once you complete your course duration. Benefits Loans Up to 75% of the course fee Loans facilitated without a mortgage or guarantor * Pay only loan interest during the course tenure Pay Loan installments with the capital deductions once the course duration is completed (Flexible repayment facilities provided) * Loans granted for a maximum tenure of eight years * Free insurance cover for the income earner Parents' income considered (In the event the student is unemployed) * Conditions apply * The bank at its own discretion reserves the right to change the interest rates as per market conditions. Download Application Form "}, "32": {"url": "http://www.ndbbank.com/pages/english/individuals/Dial_Banking.jsp", "details": " Welcome to banking on the go! Dial Banking is the latest value addition to NDB Mobile Banking App. With Dial Banking facility you can perform your banking transactions even without owning a Smart Phone. Simply dial #4488# on your mobile phone to access NDB Dial Banking. Special Features You can perform the following transactions View Current Account ,Savings Account, Credit card, loans and other Deposit details Conduct fund transfers between your own NDB accounts Pay your own NDB credit card bill Pay Utility Bills via Account or NDB Credit Card (registered and one time payments) Recharge your mobile numbers (registered and one time) View cheque status Change mPIN Easy access, even in areas where data signals are not available You do not require a smart phone or a connection to the internet Forms and Applications Please fill and hand over following application forms to nearest NDB branch to register Dial Banking Application Form -&gt; click here to download Terms and Conditions -&gt; click here to download Call us on +94 11 244 8888 for more details "}, "35": {"url": "http://www.ndbbank.com/pages/english/individuals/ndb_business_class.jsp", "details": " Relationship Banking for your Business. We understand how important your business is to you, and we are ready to back you with the support you need. NDB Business Class is a personal service that we offer to give you that extra dash of encouragement to forge your business ahead. Key Features / Benefits Branded Cheque Books Free of Charge Concessionary commissions on Pay Orders and Foreign Draft Issuance Waived Off Standing Order setup fee Concession on e-Windows charge Concession on Bulk manual salary transfers LC’s at 0.175% Collection bills at 0.125% TT’s at 0.1% and much more What you’ll need Maintain a Monthly average credit balance over LKR 500,000 in a current account Fill in the Business Class Terms and Conditions Forms to be filled Terms and Conditions "}, "37": {"url": "http://www.ndbbank.com/pages/english/individuals/achara.jsp", "details": " Senior citizens and pensioners of Sri Lanka can now enjoy a bundle of benefits under NDB Achara scheme ,where they can open a Achara savings account with a minimal deposit amount of Rs. 200/- with attractive interest rates, as well as a Achara current account with a minimum deposit of Rs. 5000/-. The Achara account holders will also be issued a special “Achara” debit card and a savings pass book for their convenience. NDB Achara loan scheme dedicates itself into also lending a helping hand towards the pensioners of our country. As a means of uplifting the pensioners of Sri Lanka, the NDB Achara loan facility brings in a host of benefits for the borrower. Features and Benefits Maximum loan amount is Rs. 4,500,000/- Repayment period maximum up to 10 years subject to maximum age limit of 70 years Life insurance coverage for the borrower in case of death of the borrower the loan will be settled in full by the insurer No security requirement Eligibility Maximum age limit of 70 years as at maturity date of loan Minimum monthly pension of Rs. 15,000/- Remittance of monthly pension to NDB Documents Required Copy of the NIC/Passport Valid document to verify the address Any other document requested by the Bank NDB remains dedicated to bringing its customers one step closer to accomplishing their life long ambitions through the range of services that are accessible through its growing branch network. Further details on NDB’s many products and services can be obtained from its 24 hour Call Centre, by dialing 011 2448 888 or by visiting NDB’s website on www.ndbbank.com "}}